{"resource": "Patient", "description":"Patient resource covers data about patients and animals involved in a wide range of health-related activities including: Curative activities Psychiatric care Social services Pregnancy care Nursing and assisted living Dietary services Tracking of personal health and exercise data Tracking financial services (e.g. insurance subscriber/policy holder) The data in the Resource covers the 'who' information about the patient: its attributes are focused on the demographic information necessary to support the administrative, financial and logistic procedures. A Patient record is generally created and maintained by each organization providing care for a patient. A patient or animal receiving care at multiple organizations may therefore have its information present in multiple Patient Resources. Not all concepts are included within the base resource (such as race, ethnicity, organ donor status, nationality, etc.), but may be found in profiles defined for specific jurisdictions (e.g., US Meaningful Use Program) or standard extensions. Such fields vary widely between jurisdictions and often have different names and valuesets for the similar concepts, but they are not similar enough to be able to map and exchange.", "structure": "{\"resourceType\" : \"Patient\",\n  // from Resource: id, meta, implicitRules, and language\n  // from DomainResource: text, contained, extension, and modifierExtension\n  \"identifier\" : [{ Identifier }], // An identifier for this patient\n  \"active\" : <boolean>, // Whether this patient's record is in active use\n  \"name\" : [{ HumanName }], // A name associated with the patient\n  \"telecom\" : [{ ContactPoint }], // A contact detail for the individual\n  \"gender\" : \"<code>\", // male | female | other | unknown\n  \"birthDate\" : \"<date>\", // The date of birth for the individual\n  // deceased[x]: Indicates if the individual is deceased or not. One of these 2:\n  \"deceasedBoolean\" : <boolean>,\n  \"deceasedDateTime\" : \"<dateTime>\",\n  \"address\" : [{ Address }], // An address for the individual\n  \"maritalStatus\" : { CodeableConcept }, // Marital (civil) status of a patient\n  // multipleBirth[x]: Whether patient is part of a multiple birth. One of these 2:\n  \"multipleBirthBoolean\" : <boolean>,\n  \"multipleBirthInteger\" : <integer>,\n  \"photo\" : [{ Attachment }], // Image of the patient\n  \"contact\" : [{ // A contact party (e.g. guardian, partner, friend) for the patient\n    \"relationship\" : [{ CodeableConcept }], // The kind of relationship\n    \"name\" : { HumanName }, // I A name associated with the contact person\n    \"telecom\" : [{ ContactPoint }], // I A contact detail for the person\n    \"address\" : { Address }, // I Address for the contact person\n    \"gender\" : \"<code>\", // male | female | other | unknown\n    \"organization\" : { Reference(Organization) }, // I Organization that is associated with the contact\n    \"period\" : { Period } // The period during which this contact person or organization is valid to be contacted relating to this patient\n  }],\n  \"communication\" : [{ // A language which may be used to communicate with the patient about his or her health\n    \"language\" : { CodeableConcept }, // R!  The language which can be used to communicate with the patient about his or her health\n    \"preferred\" : <boolean> // Language preference indicator\n  }],\n  \"generalPractitioner\" : [{ Reference(Organization|Practitioner|\n   PractitionerRole) }], // Patient's nominated primary care provider\n  \"managingOrganization\" : { Reference(Organization) }, // Organization that is the custodian of the patient record\n  \"link\" : [{ // Link to a Patient or RelatedPerson resource that concerns the same actual individual\n    \"other\" : { Reference(Patient|RelatedPerson) }, // R!  The other patient or related person resource that the link refers to\n    \"type\" : \"<code>\" // R!  replaced-by | replaces | refer | seealso\n  }]\n}"}
{"resource": "Encounter", "description": "The Encounter resource represents the diverse patient interactions within a healthcare setting, encompassing ambulatory, emergency, home health, inpatient, and virtual encounters. This resource covers the complete lifecycle of these interactions, from pre-admission through the actual encounter (for ambulatory visits) to admission, stay, and discharge (for inpatient visits). During an encounter, patients may move between different practitioners and locations, and due to its broad scope, not all elements will be relevant in every setting. To manage this variability, admission and discharge-related information is maintained in a separate admission component within the Encounter resource. The class element distinguishes between settings, guiding the application of business rules and validation processes. There is substantial variability in how different organizations and jurisdictions determine the start of a new encounter and the level of aggregation used. For instance, some organizations may treat each practitioner visit during a hospitalization as a separate encounter, while others may aggregate all visits into a single encounter for the entire admission. Encounters can also be grouped or aggregated under other encounters using the partOf element. This resource can include pre-admission information, with planned encounters reflected by setting the status element to 'planned'. The admission component stores extended information related to an admission event, covering the same period as the encounter itself. If the periods differ, another encounter instance should be used and linked using the partOf element. In terms of relationship to procedures, the Procedure and Encounter resources reference each other. Procedure.encounter refers to procedures performed during the encounter, while Encounter.reason refers to encounters resulting from another procedure, such as a follow-up encounter. The Encounter resource is crucial for documenting and managing the various admissions and movements of patients within healthcare settings, ensuring comprehensive and organized patient care. This resource captures a wide range of information about patient interactions, supporting efficient healthcare delivery and continuity of care.", "structure": "{\"resourceType\" : \"Encounter\",\n  // from Resource: id, meta, implicitRules, and language\n  // from DomainResource: text, contained, extension, and modifierExtension\n  \"identifier\" : [{ Identifier }], // Identifier(s) by which this encounter is known\n  \"status\" : \"<code>\", // R!  planned | in-progress | on-hold | discharged | completed | cancelled | discontinued | entered-in-error | unknown\n  \"class\" : [{ CodeableConcept }], // Classification of patient encounter context - e.g. Inpatient, outpatient icon\n  \"priority\" : { CodeableConcept }, // Indicates the urgency of the encounter icon\n  \"type\" : [{ CodeableConcept }], // Specific type of encounter (e.g. e-mail consultation, surgical day-care, ...)\n  \"serviceType\" : [{ CodeableReference(HealthcareService) }], // Specific type of service\n  \"subject\" : { Reference(Group|Patient) }, // The patient or group related to this encounter\n  \"subjectStatus\" : { CodeableConcept }, // The current status of the subject in relation to the Encounter\n  \"episodeOfCare\" : [{ Reference(EpisodeOfCare) }], // Episode(s) of care that this encounter should be recorded against\n  \"basedOn\" : [{ Reference(CarePlan|DeviceRequest|MedicationRequest|\n   ServiceRequest) }], // The request that initiated this encounter\n  \"careTeam\" : [{ Reference(CareTeam) }], // The group(s) that are allocated to participate in this encounter\n  \"partOf\" : { Reference(Encounter) }, // Another Encounter this encounter is part of\n  \"serviceProvider\" : { Reference(Organization) }, // The organization (facility) responsible for this encounter\n  \"participant\" : [{ // List of participants involved in the encounter\n    \"type\" : [{ CodeableConcept }], // I Role of participant in encounter\n    \"period\" : { Period }, // Period of time during the encounter that the participant participated\n    \"actor\" : { Reference(Device|Group|HealthcareService|Patient|Practitioner|\n    PractitionerRole|RelatedPerson) } // I The individual, device, or service participating in the encounter\n  }],\n  \"appointment\" : [{ Reference(Appointment) }], // The appointment that scheduled this encounter\n  \"virtualService\" : [{ VirtualServiceDetail }], // Connection details of a virtual service (e.g. conference call)\n  \"actualPeriod\" : { Period }, // The actual start and end time of the encounter\n  \"plannedStartDate\" : \"<dateTime>\", // The planned start date/time (or admit date) of the encounter\n  \"plannedEndDate\" : \"<dateTime>\", // The planned end date/time (or discharge date) of the encounter\n  \"length\" : { Duration }, // Quantity of time the encounter lasted (less time absent)\n  \"reason\" : [{ CodeableReference(Condition|Observation|Procedure|\n    AllergyIntolerance|DiagnosticReport|DocumentReference|Media|\n    ServiceRequest) }], // The list of medical reasons that are expected to be addressed during the encounter\n  \"diagnosis\" : [{ // The list of diagnosis relevant to this encounter\n    \"condition\" : { Reference(Condition) }, // R!  The diagnosed condition\n    \"use\" : { CodeableConcept }, // Role that this diagnosis has within the encounter (e.g. admission, billing, discharge …)\n    \"rank\" : <positiveInt> // Ranking of the diagnosis (for each role type)\n  }],\n  \"account\" : [{ Reference(Account) }], // The set of accounts that may be used for billing for this Encounter\n  \"dietPreference\" : [{ CodeableConcept }], // Dietary preferences\n  \"specialArrangement\" : [{ CodeableConcept }], // Special courtesies (e.g. wheelchair, translator, stretcher, etc.)\n  \"specialCourtesy\" : [{ CodeableConcept }], // Special courtesies (VIP, board member)\n  \"admission\" : { // Details about the admission to a health care service\n    \"preAdmissionIdentifier\" : { Identifier }, // Pre-admission identifier\n    \"origin\" : { Reference(Location) }, // The location/organization from which the patient came before admission\n    \"admitSource\" : { CodeableConcept }, // From where patient was admitted (physician referral, transfer)\n    \"reAdmission\" : { CodeableConcept }, // The type of hospital re-admission that has occurred (if any). If the value is absent, it means this is not a readmission\n    \"destination\" : { Reference(Location) }, // Location to which the patient is discharged\n    \"dischargeDisposition\" : { CodeableConcept } // Category or kind of location after discharge\n  },\n  \"location\" : [{ // List of locations where the patient has been\n    \"location\" : { Reference(Location) }, // R!  Location where the encounter takes place\n    \"status\" : \"<code>\", // planned | active | reserved | completed\n    \"form\" : { CodeableConcept }, // The physical form of the location (bed, room, ward, etc.)\n    \"period\" : { Period } // Time period during which the patient was present at the location\n  }],\n  \"seriousness\" : { CodeableConcept } // The seriousness of the event\n}"}
{"resource": "Procedure", "description": "The FHIR Procedure resource is integral to documenting a broad spectrum of healthcare interventions within clinical workflows. It meticulously records various procedures including surgeries, diagnostic tests, therapeutic interventions, and other clinical actions performed on patients. This resource is comprehensive, capturing not only the nature of the procedure but also crucial details such as timing, type, patient identifiers, and specific locations where the procedures occur. Each entry provides a rich context by including information about the healthcare practitioners involved, the devices used, and the organizations facilitating the procedures. The Procedure resource serves as a pivotal component for summarizing both historical and current healthcare activities, ensuring that interventions are thoroughly documented. This summary-level data is vital for maintaining accurate patient records, enabling continuity of care, and supporting clinical decision-making. Additionally, the resource can be linked to other FHIR resources, such as Encounter and Observation, to provide a holistic view of the patient's healthcare journey. Future implementations of the Procedure resource may enhance its functionality by incorporating real-time updates, allowing for dynamic tracking of ongoing procedures. This would enable healthcare providers to have immediate access to the latest procedural information, thereby improving response times and care coordination. The resource's flexibility also allows for adaptation to various clinical settings, whether it be inpatient, outpatient, emergency, or home health care, making it a versatile tool in the healthcare documentation ecosystem. Moreover, the Procedure resource can be used to capture procedural outcomes, complications, follow-up actions, and the patient's response to the intervention. This expanded data collection supports quality improvement initiatives, clinical research, and the development of evidence-based practices. By integrating these detailed records into electronic health systems, the Procedure resource facilitates better healthcare analytics, enhances patient safety, and promotes a higher standard of care delivery." ,"structure":"{\"resourceType\" : \"Procedure\",\n  // from Resource: id, meta, implicitRules, and language\n  // from DomainResource: text, contained, extension, and modifierExtension\n  \"identifier\" : [{ Identifier }], // External Identifiers for this procedure\n  \"instantiatesCanonical\" : [\"<canonical(PlanDefinition|ActivityDefinition|Measure|OperationDefinition|Questionnaire)>\"], // Instantiates FHIR protocol or definition\n  \"instantiatesUri\" : [\"<uri>\"], // Instantiates external protocol or definition\n  \"basedOn\" : [{ Reference(CarePlan|ServiceRequest) }], // A request for this procedure\n  \"partOf\" : [{ Reference(MedicationAdministration|Observation|Procedure) }], // Part of referenced event\n  \"status\" : \"<code>\", // R!  preparation | in-progress | not-done | on-hold | stopped | completed | entered-in-error | unknown\n  \"statusReason\" : { CodeableConcept }, // Reason for current status\n  \"category\" : [{ CodeableConcept }], // Classification of the procedure\n  \"code\" : { CodeableConcept }, // Identification of the procedure\n  \"subject\" : { Reference(Device|Group|Location|Organization|Patient|\n   Practitioner) }, // R!  Individual or entity the procedure was performed on\n  \"focus\" : { Reference(CareTeam|Group|Organization|Patient|Practitioner|\n   PractitionerRole|RelatedPerson|Specimen) }, // Who is the target of the procedure when it is not the subject of record only\n  \"encounter\" : { Reference(Encounter) }, // The Encounter during which this Procedure was created\n  // occurrence[x]: When the procedure occurred or is occurring. One of these 6:\n  \"occurrenceDateTime\" : \"<dateTime>\",\n  \"occurrencePeriod\" : { Period },\n  \"occurrenceString\" : \"<string>\",\n  \"occurrenceAge\" : { Age },\n  \"occurrenceRange\" : { Range },\n  \"occurrenceTiming\" : { Timing },\n  \"recorded\" : \"<dateTime>\", // When the procedure was first captured in the subject's record\n  \"recorder\" : { Reference(Patient|Practitioner|PractitionerRole|\n   RelatedPerson) }, // Who recorded the procedure\n  // reported[x]: Reported rather than primary record. One of these 2:\n  \"reportedBoolean\" : <boolean>,\n  \"reportedReference\" : { Reference(Organization|Patient|Practitioner|\n   PractitionerRole|RelatedPerson) },\n  \"performer\" : [{ // Who performed the procedure and what they did\n    \"function\" : { CodeableConcept }, // Type of performance\n    \"actor\" : { Reference(CareTeam|Device|HealthcareService|Organization|\n    Patient|Practitioner|PractitionerRole|RelatedPerson) }, // I R!  Who performed the procedure\n    \"onBehalfOf\" : { Reference(Organization) }, // I Organization the device or practitioner was acting for\n    \"period\" : { Period } // When the performer performed the procedure\n  }],\n  \"location\" : { Reference(Location) }, // Where the procedure happened\n  \"reason\" : [{ CodeableReference(Condition|DiagnosticReport|DocumentReference|\n   Observation|Procedure) }], // The justification that the procedure was performed\n  \"bodySite\" : [{ CodeableConcept }], // Target body sites\n  \"outcome\" : { CodeableConcept }, // The result of procedure\n  \"report\" : [{ Reference(Composition|DiagnosticReport|DocumentReference) }], // Any report resulting from the procedure\n  \"complication\" : [{ CodeableReference(Condition) }], // Complication following the procedure\n  \"followUp\" : [{ CodeableConcept }], // Instructions for follow up\n  \"note\" : [{ Annotation }], // Additional information about the procedure\n  \"focalDevice\" : [{ // Manipulated, implanted, or removed device\n    \"action\" : { CodeableConcept }, // Kind of change to device\n    \"manipulated\" : { Reference(Device) } // R!  Device that was changed\n  }],\n  \"used\" : [{ CodeableReference(BiologicallyDerivedProduct|Device|Medication|\n   Substance) }], // Items used during procedure\n  \"supportingInfo\" : [{ Reference(Any) }] // Extra information relevant to the procedure\n}"}
{"resource": "Condition", "description":"The Condition resource within FHIR serves as a comprehensive tool for capturing and managing detailed information about various health conditions, diagnoses, or clinical concerns that have significance in patient care. It is designed to accommodate a wide range of scenarios, whether documenting a specific diagnosis during an encounter, listing items on a practitioner’s Problem List, or noting concerns that may not yet be categorized. Clinicians utilize the Condition resource to assert and document specific aspects of a patient's health status. This includes recording diagnoses derived from clinical reasoning based on pathological and pathophysiological findings, identifying health issues that warrant investigation and management, or monitoring ongoing health conditions that may not present immediate negative outcomes, such as pregnancy. Each condition entry includes essential details to ensure clarity and accuracy. This includes the current clinical status (e.g., active, resolved), verification status (e.g., provisional, confirmed), and categorization (e.g., problem-list-item, encounter-diagnosis). Severity assessments and anatomical locations relevant to the condition can also be specified when necessary. The resource supports the recording of onset and resolution dates, whether defined by specific dates, age ranges, or other parameters. This allows healthcare providers to track the progression or remission of conditions over time accurately. Additionally, it captures the date when the condition was first recorded, providing a historical context for the patient's health profile. Collaboration among healthcare team members is facilitated through the inclusion of participants involved in managing the condition. This could range from care teams and practitioners to devices or related organizations. Assessment stages and supporting evidence can be documented to provide a comprehensive view of the condition's status and progression. Annotations and additional notes allow for contextual information to be included, providing insights into the nuances of the condition or considerations for ongoing care.","structure":"{\"resourceType\" : \"Condition\",\n  // from Resource: id, meta, implicitRules, and language\n  // from DomainResource: text, contained, extension, and modifierExtension\n  \"identifier\" : [{ Identifier }], // External Ids for this condition\n  \"clinicalStatus\" : { CodeableConcept }, // I R!  active | recurrence | relapse | inactive | remission | resolved | unknown\n  \"verificationStatus\" : { CodeableConcept }, // unconfirmed | provisional | differential | confirmed | refuted | entered-in-error\n  \"category\" : [{ CodeableConcept }], // I problem-list-item | encounter-diagnosis\n  \"severity\" : { CodeableConcept }, // Subjective severity of condition\n  \"code\" : { CodeableConcept }, // Identification of the condition, problem or diagnosis\n  \"bodySite\" : [{ CodeableConcept }], // Anatomical location, if relevant\n  \"subject\" : { Reference(Group|Patient) }, // R!  Who has the condition?\n  \"encounter\" : { Reference(Encounter) }, // The Encounter during which this Condition was created\n  // onset[x]: Estimated or actual date,  date-time, or age. One of these 5:\n  \"onsetDateTime\" : \"<dateTime>\",\n  \"onsetAge\" : { Age },\n  \"onsetPeriod\" : { Period },\n  \"onsetRange\" : { Range },\n  \"onsetString\" : \"<string>\",\n  // abatement[x]: When in resolution/remission. One of these 5:\n  \"abatementDateTime\" : \"<dateTime>\",\n  \"abatementAge\" : { Age },\n  \"abatementPeriod\" : { Period },\n  \"abatementRange\" : { Range },\n  \"abatementString\" : \"<string>\",\n  \"recordedDate\" : \"<dateTime>\", // Date condition was first recorded\n  \"participant\" : [{ // Who or what participated in the activities related to the condition and how they were involved\n    \"function\" : { CodeableConcept }, // Type of involvement\n    \"actor\" : { Reference(CareTeam|Device|Organization|Patient|Practitioner|\n    PractitionerRole|RelatedPerson) } // R!  Who or what participated in the activities related to the condition\n  }],\n  \"stage\" : [{ // Stage/grade, usually assessed formally\n    \"summary\" : { CodeableConcept }, // I Simple summary (disease specific)\n    \"assessment\" : [{ Reference(ClinicalImpression|DiagnosticReport|Observation) }], // I Formal record of assessment\n    \"type\" : { CodeableConcept } // Kind of staging\n  }],\n  \"evidence\" : [{ CodeableReference(Any) }], // Supporting evidence for the verification status\n  \"note\" : [{ Annotation }] // Additional information about the Condition\n}"}
{"resource": "Medication", "description": "The Medication resource within FHIR serves as a pivotal reference for accurately identifying and managing medication products across healthcare systems. It provides comprehensive details about medications, including active and inactive ingredients, formulation specifics, dosage forms, strengths, and packaging details. Each medication is uniquely identified using standardized codes such as NDC (National Drug Code) or RxNorm, linking to authoritative drug dictionaries to ensure consistency and accuracy in drug information. Beyond basic identification, the Medication resource encompasses regulatory compliance status, clinical indications, contraindications, and special handling instructions where applicable. This detailed data supports healthcare providers in making informed decisions regarding medication selection and administration. Integration capabilities with healthcare IT systems are integral to the Medication resource, facilitating seamless interoperability across different platforms. This enables electronic prescribing, medication reconciliation, and medication administration processes, ensuring accurate medication data can be accessed and utilized at various points of care. In clinical practice, the Medication resource plays a critical role in medication reconciliation, ensuring that healthcare professionals can verify medication histories, identify potential interactions, and minimize medication errors through standardized and structured drug information." ,"structure":"{\"resourceType\" : \"Medication\",\n  // from Resource: id, meta, implicitRules, and language\n  // from DomainResource: text, contained, extension, and modifierExtension\n  \"identifier\" : [{ Identifier }], // Business identifier for this medication\n  \"code\" : { CodeableConcept }, // Codes that identify this medication\n  \"status\" : \"<code>\", // active | inactive | entered-in-error\n  \"marketingAuthorizationHolder\" : { Reference(Organization) }, // Organization that has authorization to market medication\n  \"doseForm\" : { CodeableConcept }, // powder | tablets | capsule +\n  \"totalVolume\" : { Quantity }, // When the specified product code does not infer a package size, this is the specific amount of drug in the product\n  \"ingredient\" : [{ // Active or inactive ingredient\n    \"item\" : { CodeableReference(Medication|Substance) }, // R!  The ingredient (substance or medication) that the ingredient.strength relates to\n    \"isActive\" : <boolean>, // Active ingredient indicator\n    // strength[x]: Quantity of ingredient present. One of these 3:\n    \"strengthRatio\" : { Ratio },\n    \"strengthCodeableConcept\" : { CodeableConcept },\n    \"strengthQuantity\" : { Quantity }\n  }],\n  \"batch\" : { // Details about packaged medications\n    \"lotNumber\" : \"<string>\", // Identifier assigned to batch\n    \"expirationDate\" : \"<dateTime>\" // When batch will expire\n  },\n  \"definition\" : { Reference(MedicationKnowledge) } // Knowledge about this medication\n}"}
{"resource": "MedicationRequest", "description": "The MedicationRequest resource in FHIR is a cornerstone of modern healthcare systems, providing a comprehensive framework for managing medication orders across diverse clinical settings. It serves as a robust platform that integrates seamlessly into healthcare workflows, facilitating the precise documentation and execution of medication-related interventions. At its core, the MedicationRequest resource encompasses a wide spectrum of medication orders, ranging from those administered during hospital stays to prescriptions tailored for outpatient care. This inclusivity ensures that all facets of medication management, whether in acute settings or ongoing treatment plans, are meticulously captured and supported. Healthcare providers rely on the MedicationRequest resource to articulate and formalize medication orders with clarity and specificity. By doing so, it enhances communication between care teams, reduces medication errors, and promotes standardized practices that uphold patient safety and treatment efficacy. Furthermore, this resource plays a vital role in ensuring continuity of care by documenting the rationale behind medication choices, dosing instructions, and any pertinent clinical considerations. This documentation not only aids in decision-making but also supports regulatory compliance and quality assurance efforts within healthcare organizations. In practical terms, the MedicationRequest resource supports healthcare professionals in navigating complex medication regimens and adapting treatments to individual patient needs. It facilitates the seamless integration of medication management into clinical workflows, streamlining processes from prescription to administration and enabling timely adjustments based on patient responses and evolving clinical circumstances. Ultimately, the MedicationRequest resource in FHIR stands as a cornerstone of patient-centered care, empowering healthcare providers with the tools and information needed to deliver safe, effective, and personalized medication therapies that optimize health outcomes and improve overall quality of life." ,"structure":"{\"resourceType\" : \"MedicationRequest\",\n  // from Resource: id, meta, implicitRules, and language\n  // from DomainResource: text, contained, extension, and modifierExtension\n  \"identifier\" : [{ Identifier }], // External ids for this request\n  \"basedOn\" : [{ Reference(CarePlan|ImmunizationRecommendation|\n   MedicationRequest|ServiceRequest) }], // A plan or request that is fulfilled in whole or in part by this medication request\n  \"priorPrescription\" : { Reference(MedicationRequest) }, // Reference to an order/prescription that is being replaced by this MedicationRequest\n  \"groupIdentifier\" : { Identifier }, // Composite request this is part of\n  \"status\" : \"<code>\", // R!  active | on-hold | ended | stopped | completed | cancelled | entered-in-error | draft | unknown\n  \"statusReason\" : { CodeableConcept }, // Reason for current status\n  \"statusChanged\" : \"<dateTime>\", // When the status was changed\n  \"intent\" : \"<code>\", // R!  proposal | plan | order | original-order | reflex-order | filler-order | instance-order | option\n  \"category\" : [{ CodeableConcept }], // Grouping or category of medication request\n  \"priority\" : \"<code>\", // routine | urgent | asap | stat\n  \"doNotPerform\" : <boolean>, // True if patient is to stop taking or not to start taking the medication\n  \"medication\" : { CodeableReference(Medication) }, // R!  Medication to be taken\n  \"subject\" : { Reference(Group|Patient) }, // R!  Individual or group for whom the medication has been requested\n  \"informationSource\" : [{ Reference(Organization|Patient|Practitioner|\n   PractitionerRole|RelatedPerson) }], // The person or organization who provided the information about this request, if the source is someone other than the requestor\n  \"encounter\" : { Reference(Encounter) }, // Encounter created as part of encounter/admission/stay\n  \"supportingInformation\" : [{ Reference(Any) }], // Information to support fulfilling of the medication\n  \"authoredOn\" : \"<dateTime>\", // When request was initially authored\n  \"requester\" : { Reference(Device|Organization|Patient|Practitioner|\n   PractitionerRole|RelatedPerson) }, // Who/What requested the Request\n  \"reported\" : <boolean>, // Reported rather than primary record\n  \"performerType\" : { CodeableConcept }, // Desired kind of performer of the medication administration\n  \"performer\" : [{ Reference(CareTeam|DeviceDefinition|HealthcareService|\n   Organization|Patient|Practitioner|PractitionerRole|RelatedPerson) }], // Intended performer of administration\n  \"device\" : [{ CodeableReference(DeviceDefinition) }], // Intended type of device for the administration\n  \"recorder\" : { Reference(Practitioner|PractitionerRole) }, // Person who entered the request\n  \"reason\" : [{ CodeableReference(Condition|Observation) }], // Reason or indication for ordering or not ordering the medication\n  \"courseOfTherapyType\" : { CodeableConcept }, // Overall pattern of medication administration\n  \"insurance\" : [{ Reference(ClaimResponse|Coverage) }], // Associated insurance coverage\n  \"note\" : [{ Annotation }], // Information about the prescription\n  \"renderedDosageInstruction\" : \"<markdown>\", // Full representation of the dosage instructions\n  \"effectiveDosePeriod\" : { Period }, // Period over which the medication is to be taken\n  \"dosageInstruction\" : [{ Dosage }], // Specific instructions for how the medication should be taken\n  \"dispenseRequest\" : { // Medication supply authorization\n    \"initialFill\" : { // First fill details\n      \"quantity\" : { Quantity(SimpleQuantity) }, // First fill quantity\n      \"duration\" : { Duration } // First fill duration\n    },\n    \"dispenseInterval\" : { Duration }, // Minimum period of time between dispenses\n    \"validityPeriod\" : { Period }, // Time period supply is authorized for\n    \"numberOfRepeatsAllowed\" : \"<unsignedInt>\", // Number of refills authorized\n    \"quantity\" : { Quantity(SimpleQuantity) }, // Amount of medication to supply per dispense\n    \"expectedSupplyDuration\" : { Duration }, // Number of days supply per dispense\n    \"dispenser\" : { Reference(Organization) }, // Intended performer of dispense\n    \"dispenserInstruction\" : [{ Annotation }], // Additional information for the dispenser\n    \"doseAdministrationAid\" : { CodeableConcept } // Type of adherence packaging to use for the dispense\n  },\n  \"substitution\" : { // Any restrictions on medication substitution\n    // allowed[x]: Whether substitution is allowed or not. One of these 2:\n    \"allowedBoolean\" : <boolean>,\n    \"allowedCodeableConcept\" : { CodeableConcept },\n    \"reason\" : { CodeableConcept } // Why should (not) substitution be made icon\n  },\n  \"eventHistory\" : [{ Reference(Provenance) }] // A list of events of interest in the lifecycle\n}"}
{"resource": "MedicationAdministration", "description":"The MedicationAdministration resource covers the administration of all medications. Please refer to the Immunization resource/Profile for the treatment of vaccines. It will principally be used within care settings (including inpatient) to record medication administrations, including self-administrations of oral medications, injections, intravenous infusions, etc. It can also be used in outpatient settings to record allergy shots and other non-immunization administrations. In some cases, it might be used for home-health reporting, such as recording self-administered or even device-administered insulin.\nNote: devices coated with a medication (e.g. heparin) are not typically recorded as a medication administration. However, administration of a medication via an implanted medication pump (e.g., insulin) would be recorded as a MedicationAdministration.\n\nThis resource can also be used for recording waste by setting the status to 'not-done' and the statusReason to a code that refers to waste. The remaining fields would support the waste elements, i.e. performer of the waste, quantity of medication wasted, date/time of waste, etc. It is also possible, using the partOf reference to a MedicationDispense, to indicate that this waste occurred as part of a dispense event. MedicationAdministration is intended for tracking the administration of medications. Administration of vaccines is intended to be handled using the Immunization resource. Some systems treat immunizations in the same way as any other medication administration. Such systems SHOULD use an immunization resource to represent these. However, if systems need to use a MedicationAdministration resource to capture vaccinations for workflow or other reasons, a Medication Administration resource may be used but systems SHOULD also create and expose an equivalent Immunization instance.","structure":"{\"resourceType\" : \"MedicationAdministration\",\n  // from Resource: id, meta, implicitRules, and language\n  // from DomainResource: text, contained, extension, and modifierExtension\n  \"identifier\" : [{ Identifier }], // External identifier\n  \"basedOn\" : [{ Reference(CarePlan) }], // Plan this is fulfilled by this administration\n  \"partOf\" : [{ Reference(MedicationAdministration|MedicationDispense|\n   Procedure) }], // Part of referenced event\n  \"status\" : \"<code>\", // R!  in-progress | not-done | on-hold | completed | entered-in-error | stopped | unknown\n  \"statusReason\" : [{ CodeableConcept }], // Reason administration not performed\n  \"category\" : [{ CodeableConcept }], // Type of medication administration\n  \"medication\" : { CodeableReference(Medication) }, // R!  What was administered\n  \"subject\" : { Reference(Group|Patient) }, // R!  Who received medication\n  \"encounter\" : { Reference(Encounter) }, // Encounter administered as part of\n  \"supportingInformation\" : [{ Reference(Any) }], // Additional information to support administration\n  // occurence[x]: \n     Specific date/time or interval of time during which the administration took place (or did not take place). One of these 3:\n  \"occurenceDateTime\" : \"<dateTime>\",\n  \"occurencePeriod\" : { Period },\n  \"occurenceTiming\" : { Timing },\n  \"recorded\" : \"<dateTime>\", // When the MedicationAdministration was first captured in the subject's record\n  \"isSubPotent\" : <boolean>, // Full dose was not administered\n  \"subPotentReason\" : [{ CodeableConcept }], // Reason full dose was not administered\n  \"performer\" : [{ // Who or what performed the medication administration and what type of performance they did\n    \"function\" : { CodeableConcept }, // Type of performance\n    \"actor\" : { CodeableReference(Device|Patient|Practitioner|PractitionerRole|\n    RelatedPerson) } // R!  Who or what performed the medication administration\n  }],\n  \"reason\" : [{ CodeableReference(Condition|DiagnosticReport|Observation) }], // Concept, condition or observation that supports why the medication was administered\n  \"request\" : { Reference(MedicationRequest) }, // Request administration performed against\n  \"device\" : [{ CodeableReference(Device) }], // Device used to administer\n  \"note\" : [{ Annotation }], // Information about the administration\n  \"dosage\" : { // Details of how medication was taken\n    \"text\" : \"<string>\", // I Free text dosage instructions e.g. SIG\n    \"site\" : { CodeableConcept }, // Body site administered to\n    \"route\" : { CodeableConcept }, // Path of substance into body\n    \"method\" : { CodeableConcept }, // How drug was administered\n    \"dose\" : { Quantity(SimpleQuantity) }, // I Amount of medication per dose\n    // rate[x]: Dose quantity per unit of time. One of these 2:\n    \"rateRatio\" : { Ratio },\n    \"rateQuantity\" : { Quantity(SimpleQuantity) }\n  },\n  \"eventHistory\" : [{ Reference(Provenance) }] // A list of events of interest in the lifecycle\n}"}
{"resource": "PractitionerRole", "description": "The PractitionerRole describes the types of services that practitioners provide for an organization at specific location(s). The PractitionerRole resource can be used in multiple contexts including: Provider Registries where it indicates what a practitioner can perform for an organization (may indicate multiple healthcareservices, locations, and roles) In a Clinical system where it indicates the role, healthcareservice and location details associated with a practitioner that are applicable to the healthcare event (e.g. Observation, Appointment, Condition, CarePlan) In a Clinical system as a point of reference rather than an event, such as a patient's preferred general practitioner (at a specific clinic) The role, specialty, Location telecom and HealthcareService properties can be repeated if required in other instances of the PractitionerRole. Some systems record a collection of service values for a single location, others record the single service and the list of locations it is available. Both are acceptable options for representing this data. Where availability, telecom, or other details are not the same across all healthcareservices, or locations a separate PractitionerRole instance should be created. Many resource types have a choice of a reference to either a Practitioner resource or a PractitionerRole resource. The latter provides organizational context for the practitioners participation when it is required, otherwise a direct reference to the practitioner may be used. Many implementations may choose to profile the PractitionerRole to a single location/role/healthcareservice for their specific usage. As the property that references a PractitionerRole typically has a specific context, the code on the PractitionerRole having duplicate code values is not a big concern (and is used for discovery where required). e.g. These references are all very context specific: Patient.GeneralPractitioner, CarePlan.reported, CarePlan.contributor, Appointment.participant (through the participant.role), Immunization.informationSource, Immunization.performer (through the performer.function property) For use cases where an organization has activities where a practitioner is not defined/pre-allocated for a specific role (e.g. an un-named surgeon at XYZ Hospital), a PractitionerRole resource can be used with an empty Practitioner property, and the other relevant role properties populated - i.e. code, organization. Practitioner performs different roles within the same or even different organizations. Depending on jurisdiction and custom, it may be necessary to maintain a specific Practitioner Resource for each such role or have a single Practitioner with multiple roles. The role can be limited to a specific period, after which authorization for this role ends. Note that the represented organization need not necessarily be the (direct) employer of a Practitioner.", "structure": { "resourceType": "PractitionerRole", "identifier": [{ "Identifier": {} }], "active": "<boolean>", "period": { "Period": {} }, "practitioner": { "Reference": "Practitioner" }, "organization": { "Reference": "Organization" }, "code": [{ "CodeableConcept": {} }], "specialty": [{ "CodeableConcept": {} }], "location": [{ "Reference": "Location" }], "healthcareService": [{ "Reference": "HealthcareService" }], "contact": [{ "ExtendedContactDetail": {} }], "characteristic": [{ "CodeableConcept": {} }], "communication": [{ "CodeableConcept": {} }], "availability": [{ "Availability": {} }], "endpoint": [{ "Reference": "Endpoint" }] } }
{"resource": "RelatedPerson", "description": "RelatedPersons typically have a personal relationship or non-healthcare-specific professional relationship to the patient. A RelatedPerson resource is primarily used for attribution of information, since RelatedPersons are often a source of information about the patient. For keeping information about people for contact purposes for a patient, use a Patient's Contact element. Some individuals may serve as both a Patient's Contact and a Related Person. Example RelatedPersons are: A patient's wife or husband A patient's relatives or friends A neighbor bringing a patient to the hospital The owner or trainer of a horse A patient's attorney or guardian A Guide Dog. The primary distinction between a Practitioner and a RelatedPerson is based on whether: The person/animal operates on behalf of the care delivery organization over multiple patients (Practitioner) or, Where the person/animal is not associated with the organization, and instead is allocated tasks specifically for the RelatedPerson's Patient (RelatedPerson). A standard extension animalSpecies can be used to indicate the species of a service animal.", "structure": { "resourceType": "RelatedPerson", "identifier": [{ "Identifier": {} }], "active": "<boolean>", "patient": { "Reference": "Patient" }, "relationship": [{ "CodeableConcept": {} }], "name": [{ "HumanName": {} }], "telecom": [{ "ContactPoint": {} }], "gender": "<code>", "birthDate": "<date>", "address": [{ "Address": {} }], "photo": [{ "Attachment": {} }], "period": { "Period": {} }, "communication": [{ "language": { "CodeableConcept": {} }, "preferred": "<boolean>" }] } }
{"resource": "Person", "description": "The Person resource serves as a linkage resource that may provide a reference set of common demographics for an individual (human or animal) across multiple roles. This linkage can be direct to role-specific FHIR resources (Patient, Practitioner and RelatedPerson) residing on the same or possibly distinct FHIR systems/applications, or indirectly through the use of business identifiers. The Person resource may be used in many situations/contexts, including: A set of demographics that can be used to co-ordinate the maintenance of this de-normalized information across practitioners, patients and/or related persons e.g. link known resources of the different types together within a system A state/network based Master Person Index e.g. A National Identifier Index or a Network membership/subscriber list A central register that links patient resources from multiple servers, indicating they all correspond to the same individual e.g. Within a large organization with many systems to be able to link the various records, without having to modify the source information with external links A support for access monitoring software that is able to assert what practitioner, patient and related person records correspond to the same human being to assist in detecting improper querying. e.g. asserting that a Patient A is the same individual as a RelatedPerson B who is related to Patient C, who is also Practitioner D. As such, monitoring for Practitioner D’s accesses to Patient A’s records should be carefully scrutinized. Local record(s) on a mobile device listing links to remote server patient resources e.g. A mobile phone application storing references to the hospitals they have access to. Person resources may have references to Patient, RelatedPerson and/or Practitioner resources. These linkages assert that all the records relate to the same individual. Person instances are NEVER directly referenced as actors (authors, subjects, performers, etc.) Individual actors are always identified as either Patient, Practitioner or RelatedPerson, depending on the role of the individual when undertaking the action. Therefore this resource SHALL NOT be referenced by any other clinical or administrative resources. E.g. it can be the focus of an operation or message or included in a Bundle, but cannot be a member of a List or Group, the subject of an Observation, or other similar non-infrastructural usage. Note that the usage of Practitioner is broader in FHIR than the term may suggest, and can encompass individuals who are not licensed healthcare practitioners. In some use cases the linkages will be indirect, and through business Identifiers, such as in the case of the various types of Master Person Indexes, where the records are not there for the purpose of healthcare, but simply describing a population of people, and has other purposes and not just to represent a population patients.", "structure": { "resourceType": "Person", "identifier": [{ "Identifier": {} }], "active": "<boolean>", "name": [{ "HumanName": {} }], "telecom": [{ "ContactPoint": {} }], "gender": "<code>", "birthDate": "<date>", "deceasedBoolean": "<boolean>", "deceasedDateTime": "<dateTime>", "address": [{ "Address": {} }], "maritalStatus": { "CodeableConcept": {} }, "photo": [{ "Attachment": {} }], "communication": [{ "language": { "CodeableConcept": {} }, "preferred": "<boolean>" }], "managingOrganization": { "Reference": "Organization" }, "link": [{ "target": { "Reference": ["Patient", "Person", "Practitioner", "RelatedPerson"] }, "assurance": "<code>" }] } }
{"resource": "Organization", "description": "This resource may be used in a shared registry of contact and other information for various organizations or it can be used merely as a support for other resources that need to reference organizations, perhaps as a document, message or as a contained resource. If using a registry approach, it's entirely possible for multiple registries to exist, each dealing with different types or levels of organization. The Organization resource is used for collections of people that have come together to achieve an objective. The Group resource is used to identify a collection of people (or animals, devices, etc.) that are gathered for the purpose of analysis or acting upon, but are not expected to act themselves. The Organization resource often exists as a hierarchy of organization resources, using the part-of property to provide the association of the child to its parent organization. This organizational hierarchy helps communicate the conceptual structure, whereas the Location resource provides the physical representation of the hierarchy. The linkage between Organization and Location is from each point in the location hierarchy to the appropriate level in the Organization hierarchy. These links don't all have to be to the top level Organization. When populating the organization and location hierarchies there is often not a clear distinction between these 2, however to assist in making the decision, Locations are always used for recording where a service occurs, and hence where encounters and observations are associated. The Organization property on these resources might not be the location where the service took place. OrganizationAffiliation allows you to specify details about organization affiliations that are more complex than simple partOf relationships, such as organizations that are separate legal entities, or have other non-hierarchical relationships. No ownership is implied via OrganizationAffiliation. A single OrganizationAffiliation represents the details of a single relationship between a single pair of Organizations, including the period during which the relationship is active. Current network members can be discovered by searching for OrganizationAffiliations, and historic data can be retained without overhead and still be accessible when searching. As noted in the Event pattern, a Location represents where a service is performed. An Organization can represent who performed the service.", "structure": { "resourceType": "Organization", "id": "<string>", "meta": { "Meta": {} }, "implicitRules": "<uri>", "language": "<code>", "text": { "Narrative": {} }, "contained": [{ "Resource": {} }], "extension": [{ "Extension": {} }], "modifierExtension": [{ "Extension": {} }], "identifier": [{ "Identifier": {} }], "active": "<boolean>", "type": [{ "CodeableConcept": {} }], "name": "<string>", "alias": ["<string>"], "description": "<markdown>", "contact": [{ "ExtendedContactDetail": {} }], "partOf": { "Reference": "Organization" }, "endpoint": [{ "Reference": "Endpoint" }], "qualification": [{ "identifier": [{ "Identifier": {} }], "code": { "CodeableConcept": {} }, "period": { "Period": {} }, "issuer": { "Reference": "Organization" } }] } }
{"resource": "OrganizationAffiliation", "description": "A relationship between 2 organizations over a period of time, where the entities are separate business entities. The relationship can optionally include details of locations/services from the participating organization. The OrganizationAffiliation enables defining non-hierarchical relationships between organizations. For example: One organization may provide services to another organization e.g. An agency service providing casual staff, a radiology service, a diagnostic lab, catering services, community care services etc. Two or more organizations may form a partnership or joint venture An organization may be a member of an association, but not owned by it e.g. a hospital is a member the American Hospital Association, a hospital is a member of a health information exchange network Spotless Cleaning Services (participatingOrganization) is a supplier (code) to General Hospital (organization) General Hospital (participatingOrganization) is a member (code) of Eastern HIE (organization). The Organization.partOf is used to form a hierarchical relationships within an organization which eventually resolves to a single organization. Each child in the tree is a subdivision of the parent. The OrganizationAffiliation is used to describe the relationship between two distinct organizations. It does not require a hierarchical relationship. A resource instance is for a singular linkage between 2 organizations (it does not contain all members), to create multiple affiliations, create additional resources for the other relationship between other organizations. Each instance contains its own period, and optionally links to specific related services/locations that are available. These referenced locations/services should be associated with the participating organization, and are available to the primary organization. This resource should not be used when the affiliates are part of a single organization.", "structure": { "resourceType": "OrganizationAffiliation", "id": "<string>", "meta": { "Meta": {} }, "implicitRules": "<uri>", "language": "<code>", "text": { "Narrative": {} }, "contained": [{ "Resource": {} }], "extension": [{ "Extension": {} }], "modifierExtension": [{ "Extension": {} }], "identifier": [{ "Identifier": {} }], "active": "<boolean>", "period": { "Period": {} }, "organization": { "Reference": "Organization" }, "participatingOrganization": { "Reference": "Organization" }, "network": [{ "Reference": "Organization" }], "code": [{ "CodeableConcept": {} }], "specialty": [{ "CodeableConcept": {} }], "location": [{ "Reference": "Location" }], "healthcareService": [{ "Reference": "HealthcareService" }], "contact": [{ "ExtendedContactDetail": {} }], "endpoint": [{ "Reference": "Endpoint" }] } }
{"resource": "HealthcareService", "description": "The HealthcareService resource is used to describe a single healthcare service or category of services that are provided by an organization at a location. The location of the services could be virtual, as with telemedicine services. Common examples of HealthcareServices resources are: Allied Health Clinical Neuropsychologist Podiatry Service Smallville Hospital Emergency Services Respite care provided at a nursing home or hostel 24hr crisis telephone counseling service Information, advice and/or referral services; Disability, Telecommunications Rural TeleHealth Services Hospital in the home Yellow Cabs Pharmacy Active Rehab Social Support Drug and/or alcohol counseling Day Programs, Adult Training & Support Services Consulting psychologists and/or psychology services Group Hydrotherapy Little River Home Maintenance CT Head Scan w/o Contrast CT Head Scan with Contrast CT Head+Chest Scan with Contrast HealthcareService resources do not represent Computer related Services (not SOA) Example uses of HealthcareService resources are: National Services Directory - Consumer Focus National Services Directory - Practitioner Referrals Searching Organization's Client Portal - to locate services / book appointments Address book of services for Referrals including references to Questionnaires for assessments that are required as part of the referral Health Network internal directory Used for tracking available services offered internally, and also those offered by business partners. This information may also include costing information. Catalog of schedulable services or activities. The HealthcareService resource can be used with the Schedule resource to define actual availability of the service. This would be done by using the Schedule's Actor property. When creating an Appointment, the HealthcareService is to be assigned to one of the participants. It is up to the scheduling system to determine if the service is available and can be accepted. The HealthcareService resource is used with the following resources: Organization: The organization provides the services, the healthcareservice describes the services ServiceRequest: This is a subject specific request for a specific service, it may be to a specific healthcare service, and/or simply a coded service value. The granularity included in the request codes may be finer than defined in the healthcare service. OrganizationAffiliation: Might constrain a list of healthcare services that are available between 2 organizations Location: Specifies the place where the service(s) are offered/available within.", "structure": { "resourceType": "HealthcareService", "id": "<string>", "meta": { "Meta": {} }, "implicitRules": "<uri>", "language": "<code>", "text": { "Narrative": {} }, "contained": [{ "Resource": {} }], "extension": [{ "Extension": {} }], "modifierExtension": [{ "Extension": {} }], "identifier": [{ "Identifier": {} }], "active": "<boolean>", "providedBy": { "Reference": "Organization" }, "offeredIn": [{ "Reference": "HealthcareService" }], "category": [{ "CodeableConcept": {} }], "type": [{ "CodeableConcept": {} }], "specialty": [{ "CodeableConcept": {} }], "location": [{ "Reference": "Location" }], "name": "<string>", "comment": "<markdown>", "extraDetails": "<markdown>", "photo": { "Attachment": {} }, "contact": [{ "ExtendedContactDetail": {} }], "coverageArea": [{ "Reference": "Location" }], "serviceProvisionCode": [{ "CodeableConcept": {} }], "eligibility": [{ "code": { "CodeableConcept": {} }, "comment": "<markdown>" }], "program": [{ "CodeableConcept": {} }], "characteristic": [{ "CodeableConcept": {} }], "communication": [{ "CodeableConcept": {} }], "referralMethod": [{ "CodeableConcept": {} }], "appointmentRequired": "<boolean>", "availability": [{ "Availability": {} }], "endpoint": [{ "Reference": "Endpoint" }] } }
{"resource": "Endpoint", "description": "An endpoint describes the technical details of a location that can be connected to for the delivery/retrieval of information. Sufficient information is required to ensure that a connection can be made securely, and appropriate data transmitted as defined by the endpoint owner. This is not a description of details of the current system, as found in CapabilityStatement, but of another (potentially external) system. These may be locally hosted services, regional services, or national service. These resources are typically used to identify where to locate endpoint details for: Questionnaires: Where to send information (currently an SDC extension with just the address) ValueSet: Where related Terminology Services can be found (where not local) Subscription: The destination to send the subscribed data (or to pull) Messaging: (currently defined in the Message Header, but only as the address) Referrals: Where to send referral requests (linked to the services directory resources - Organization/Location/Practitioner/HealthcareService) Referrals - Templates: Where to locate referral templates (Questionnaires) (linked to the services directory resources - Organization/Location/Practitioner/HealthcareService) CarePlans: Where a shared CarePlan can be found Scheduling: Where to lookup to discover schedules/availability information (linked to the services directory resources - Organization/Location/Practitioner/HealthcareService) Scheduling: Where to lookup to send appointment requests (linked to the services directory resources - Organization/Location/Practitioner/HealthcareService) Patient/Person: Location of Master Patient/Person Indexes Service Provider Directories: Location of related directories (parent/child/federated) DICOM/imaging: Location of where to query, retrieve or store imaging content and metadata (QIDO-RS, WADO-RS, WADO-URI, STOW-RS). The endpoint is distinct from a capability statement in that the CapabilityStatement statement describes the entire capability of a system (and in the metadata case, just this system) Where the endpoint resource describes the technical details for how to connect, and for what purposes (which could be a small sub-set of the system's capabilities, and might not be a FHIR endpoint). Endpoints are used to facilitate system to system communication, providing the details of the addressing of the system, purpose of use, protocols required/provided, and any other details required to communicate between the systems. (such as configuration parameters, require headers ...) The address value in the endpoint can only be used in the context of the provided details. E.g. If the endpoint has a URL for an XDS service, using that in a browser by a user is meaningless. E.g.2 If the endpoint has a US Direct address, using this to send a normal email message will not work, as they are not true email addresses (even though they appear to be) A ContactPoint contains contact information, such as a phone number, web address that a user can directly interact with, no additional information would be required to use the value. The value is generally used to communicate with an entity directly, not a system.", "structure": { "resourceType": "Endpoint", "id": "<string>", "meta": { "Meta": {} }, "implicitRules": "<uri>", "language": "<code>", "text": { "Narrative": {} }, "contained": [{ "Resource": {} }], "extension": [{ "Extension": {} }], "modifierExtension": [{ "Extension": {} }], "identifier": [{ "Identifier": {} }], "status": "<code>", "connectionType": [{ "CodeableConcept": {} }], "name": "<string>", "description": "<string>", "environmentType": [{ "CodeableConcept": {} }], "managingOrganization": { "Reference": "Organization" }, "contact": [{ "ContactPoint": {} }], "period": { "Period": {} }, "payload": [{ "type": [{ "CodeableConcept": {} }], "mimeType": ["<code>"] }], "address": "<url>", "header": ["<string>"] } }
{"resource": "Observation", "description": "The FHIR Observation resource is a cornerstone in the healthcare data model, designed to document a vast array of clinical information essential for patient care. This resource plays a pivotal role in capturing observations that support clinical diagnoses, monitor patient progress, establish baseline health metrics, and identify patterns over time. It also encompasses the recording of demographic characteristics and results of tests performed on products and substances, providing a comprehensive view of patient health and healthcare interventions. Observations recorded in this resource often appear as simple name/value pair assertions, such as a blood pressure reading or body temperature measurement, accompanied by relevant metadata. However, the Observation resource is not limited to simple data points. It also supports more complex entries that logically group multiple observations together or contain several components. This flexibility allows healthcare providers to document a broad spectrum of clinical data with precision and detail. The types of data captured by the Observation resource are extensive and varied. Vital signs, such as body weight, blood pressure, and temperature, are routinely recorded, providing critical information for ongoing patient monitoring. Laboratory data, including blood glucose levels, estimated glomerular filtration rate (eGFR), and other biochemical markers, are documented to inform diagnostic and therapeutic decisions. Imaging results, such as bone density measurements or fetal ultrasound findings, are also captured within this resource, offering valuable insights into patient conditions that require visual assessment. Clinical findings, another category of data within the Observation resource, include detailed observations like abdominal tenderness or the presence of a rash. These findings are crucial for forming diagnostic impressions and planning treatment strategies. Additionally, the resource records device measurements, such as electrocardiogram (EKG) data or pulse oximetry readings, which are essential for monitoring the functioning of the heart and oxygenation status of the patient. Device settings, including parameters for mechanical ventilators, are documented to ensure proper configuration and management of medical devices used in patient care. Clinical assessment tools, such as the APGAR score for newborns or the Glasgow Coma Scale for assessing consciousness in trauma patients, are recorded within the Observation resource, providing standardized measures of patient status. Personal characteristics, such as eye color, and social history elements, like tobacco use, family support, or cognitive status, are included to give a holistic view of the patient's background and lifestyle factors that may influence health outcomes. Core characteristics, including pregnancy status or assertions of death, are also documented, ensuring that critical information about the patient's current condition is readily available. The Observation resource is designed to express a wide range of data through either simple name-value pairs or structured collections of name-value pairs. This design allows it to capture measurements and subjective point-in-time assessments accurately. While its primary purpose is to represent various types of clinical and diagnostic data, it is versatile enough to support the documentation of complex and detailed clinical information.", "structure": { "resourceType": "Observation", "id": "<string>", "meta": { "Meta": {} }, "implicitRules": "<uri>", "language": "<code>", "text": { "Narrative": {} }, "contained": [{ "Resource": {} }], "extension": [{ "Extension": {} }], "modifierExtension": [{ "Extension": {} }], "identifier": [{ "Identifier": {} }], "instantiatesCanonical": [{ "Reference": "CanonicalResource" }], "instantiatesUri": [{ "Reference": "Uri" }], "basedOn": [ { "Reference": "CarePlan" }, { "Reference": "DeviceRequest" }, { "Reference": "ImmunizationRecommendation" }, { "Reference": "MedicationRequest" }, { "Reference": "NutritionOrder" }, { "Reference": "ServiceRequest" } ], "status": "<code>", "category": [{ "CodeableConcept": {} }], "code": { "CodeableConcept": {} }, "subject": { "Reference": "Group" }, "focus": [{ "Reference": "Any" }], "encounter": { "Reference": "Encounter" }, "effectiveDateTime": "<dateTime>", "effectivePeriod": { "Period": {} }, "effectiveTiming": { "Timing": {} }, "effectiveInstant": "<instant>", "issued": "<instant>", "performer": [ { "Reference": "CareTeam" }, { "Reference": "Device" }, { "Reference": "Organization" }, { "Reference": "Patient" }, { "Reference": "Practitioner" }, { "Reference": "PractitionerRole" }, { "Reference": "RelatedPerson" } ], "valueQuantity": { "Quantity": {} }, "valueCodeableConcept": { "CodeableConcept": {} }, "valueString": "<string>", "valueBoolean": "<boolean>", "valueInteger": "<integer>", "valueRange": { "Range": {} }, "valueRatio": { "Ratio": {} }, "valueSampledData": { "SampledData": {} }, "valueTime": "<time>", "valueDateTime": "<dateTime>", "valuePeriod": { "Period": {} }, "dataAbsentReason": { "CodeableConcept": {} }, "interpretation": [{ "CodeableConcept": {} }], "note": [{ "Annotation": {} }], "bodySite": { "CodeableConcept": {} }, "method": { "CodeableConcept": {} }, "specimen": { "Reference": "Specimen" }, "device": { "Reference": "Device" }, "referenceRange": [ { "low": { "Quantity": {} }, "high": { "Quantity": {} }, "type": { "CodeableConcept": {} }, "appliesTo": [{ "CodeableConcept": {} }], "age": { "Range": {} }, "text": "<string>" } ], "hasMember": [{ "Reference": "Observation" }, { "Reference": "QuestionnaireResponse" }, { "Reference": "MolecularSequence" }], "derivedFrom": [{ "Reference": "Any" }], "component": [ { "code": { "CodeableConcept": {} }, "valueQuantity": { "Quantity": {} }, "valueCodeableConcept": { "CodeableConcept": {} }, "valueString": "<string>", "valueBoolean": "<boolean>", "valueInteger": "<integer>", "valueRange": { "Range": {} }, "valueRatio": { "Ratio": {} }, "valueSampledData": { "SampledData": {} }, "valueTime": "<time>", "valueDateTime": "<dateTime>", "valuePeriod": { "Period": {} }, "dataAbsentReason": { "CodeableConcept": {} }, "interpretation": [{ "CodeableConcept": {} }], "referenceRange": [ { "low": { "Quantity": {} }, "high": { "Quantity": {} }, "type": { "CodeableConcept": {} }, "appliesTo": [{ "CodeableConcept": {} }], "age": { "Range": {} }, "text": "<string>" } ] } ] } }
{"resource": "MedicationDispense", "description": "The MedicationDispense resource in FHIR serves as a comprehensive record detailing the process of dispensing medications to patients within healthcare settings. It plays a crucial role in ensuring that patients receive the correct medication in the appropriate dosage and quantity, adhering strictly to prescribed treatment plans. At its core, the MedicationDispense resource captures essential information about each dispensing event. This includes detailed specifics about the medication itself, such as its name, strength, form, and any unique identifiers necessary for accurate identification. The resource meticulously tracks the entire dispensing process from start to finish, ensuring thorough documentation of each step involved. Key elements recorded within the resource include critical details about the supplier responsible for dispensing the medication, ensuring accountability and quality assurance in the distribution process. Similarly, recipient information is documented to ensure that the medication is provided to the correct patient, facilitating personalized care and treatment accuracy. Timing and scheduling information are integral parts of the MedicationDispense resource, documenting the precise date and time of each dispensation. This includes any specific instructions related to scheduling to ensure the medication is administered at the right intervals for optimal effectiveness. The resource also encompasses details about the preparation and packaging of the medication, covering processes such as compounding and packaging to ensure the medication is safely prepared and ready for use by the patient. Authorization and verification steps are thoroughly tracked within the resource, ensuring that each dispensation event is aligned with healthcare provider orders and regulatory standards. This includes documenting the authorization process and verifying that the medication is dispensed correctly according to prescribed guidelines. Detailed administration instructions are provided within the resource, offering healthcare providers clear guidelines on how to administer the medication. This includes specifying the route of administration, frequency of dosing, and any special considerations that may apply based on the patient's needs. Patient education and counseling are also recorded within the MedicationDispense resource, documenting any information provided to patients about the medication. This includes educating patients on potential side effects, proper storage methods, and guidelines for safe usage. Monitoring and follow-up actions required to assess the effectiveness and safety of the medication therapy are included in the resource. This ensures that healthcare providers can track patient progress and make informed decisions regarding ongoing treatment.", "structure": { "identifier": [ { "Identifier": {} } ], "basedOn": [ { "Reference": "CarePlan" } ], "partOf": [ { "Reference": "MedicationAdministration" }, { "Reference": "Procedure" } ], "status": "<code>", "notPerformedReason": { "CodeableReference": "DetectedIssue" }, "statusChanged": "<dateTime>", "category": [ { "CodeableConcept": {} } ], "medication": { "CodeableReference": "Medication" }, "subject": { "Reference": "Group" }, "encounter": { "Reference": "Encounter" }, "supportingInformation": [ { "Reference": "Any" } ], "performer": [ { "function": { "CodeableConcept": {} }, "actor": { "Reference": "CareTeam" } }, { "function": { "CodeableConcept": {} }, "actor": { "Reference": "Device" } }, { "function": { "CodeableConcept": {} }, "actor": { "Reference": "Organization" } }, { "function": { "CodeableConcept": {} }, "actor": { "Reference": "Patient" } }, { "function": { "CodeableConcept": {} }, "actor": { "Reference": "Practitioner" } }, { "function": { "CodeableConcept": {} }, "actor": { "Reference": "PractitionerRole" } }, { "function": { "CodeableConcept": {} }, "actor": { "Reference": "RelatedPerson" } } ], "location": { "Reference": "Location" }, "authorizingPrescription": [ { "Reference": "MedicationRequest" } ], "type": { "CodeableConcept": {} }, "quantity": { "Quantity": { "SimpleQuantity": {} } }, "daysSupply": { "Quantity": { "SimpleQuantity": {} } }, "recorded": "<dateTime>", "whenPrepared": "<dateTime>", "whenHandedOver": "<dateTime>", "destination": { "Reference": "Location" }, "receiver": [ { "Reference": "Location" }, { "Reference": "Patient" }, { "Reference": "Practitioner" }, { "Reference": "PractitionerRole" }, { "Reference": "RelatedPerson" } ], "note": [ { "Annotation": {} } ], "renderedDosageInstruction": "<markdown>", "dosageInstruction": [ { "Dosage": {} } ], "substitution": { "wasSubstituted": true, "type": { "CodeableConcept": {} }, "reason": [ { "CodeableConcept": {} } ], "responsibleParty": { "Reference": "Organization" } }, "eventHistory": [ { "Reference": "Provenance" } ] } }
{"resource": "Location", "description": "A Location includes both incidental locations (a place which is used for healthcare without prior designation or authorization) and dedicated, formally appointed locations. Locations may be private, public, mobile or fixed and scale from small freezers to full hospital buildings or parking garages.\n\nExamples of Locations are:\n\nBuilding, ward, corridor, room or bed\nMobile Clinic\nFreezer, incubator\nVehicle or lift\nHome, shed, or a garage\nRoad, parking place, a park\nAmbulance (generic)\nAmbulance (specific)\nPatient's Home (generic)\nJurisdiction\nThese locations are not intended to cover locations on a patient where something occurred (i.e. a patient's broken leg), but can happily cover the location where the patient broke the leg (the playground). Locations and Organizations are very closely related resources and can often be mixed/matched/confused.\nThe Location is intended to describe the more physical structures managed/operated by an organization, whereas the Organization is intended to represent the more conceptual hierarchies, such as a ward. Location may also be used to represent virtual locations, for example for telehealth visits.\n\nAs noted in the Event pattern, a Location represents where a service is performed. An Organization can represent who performed the service.\n\nA Location is valid without an address in cases where it could be purely described by a geo-coded location in remote areas, or when recorded by a device. Locations with a mode = \"kind\" would also likely not have an address, as they are just a type of location, but could also have an address where they can be found at the address.\nAnother use of location could be for describing a Jurisdiction. This jurisdiction may be considered a classified boundary which could be a combination of a physical boundary, and some other discriminator(s):\n\nNation - Country-wide community or Federal Government (Ministry of Health)\nProvince or State (community or Government)\nBusiness (throughout an enterprise)\nBusiness scope (CDC/FDA)\nBusiness segment (UK Pharmacy)", "structure": { "resourceType": "Location", "identifier": [ { "Identifier": {} } ], "status": "<code>", "operationalStatus": { "Coding": {} }, "name": "<string>", "alias": ["<string>"], "description": "<markdown>", "mode": "<code>", "type": [ { "CodeableConcept": {} } ], "contact": [ { "ExtendedContactDetail": {} } ], "address": { "Address": {} }, "form": { "CodeableConcept": {} }, "position": { "longitude": "<decimal>", "latitude": "<decimal>", "altitude": "<decimal>" }, "managingOrganization": { "Reference": "Organization" }, "partOf": { "Reference": "Location" }, "characteristic": [ { "CodeableConcept": {} } ], "hoursOfOperation": [ { "Availability": {} } ], "virtualService": [ { "VirtualServiceDetail": {} } ], "endpoint": [ { "Reference": "Endpoint" } ] } }
{"resource": "DocumentReference", "description": "A DocumentReference resource is used to index a document, clinical note, and other binary objects such as a photo, video, or audio recording, including those resulting from diagnostic or care provision procedures, to make them available to a healthcare system. A document is some sequence of bytes that is identifiable, establishes its own context (e.g., what subject, author, etc. can be presented to the user), and has defined update management. The DocumentReference resource can be used with any document format that has a recognized mime type and that conforms to this definition.\n\nTypically, DocumentReference resources are used in document indexing systems, such as IHE XDS icon and as profiled in IHE Mobile Access to Health Documents icon.\n\nDocumentReference contains metadata, inline content or direct references to documents such as:\n\nCDA icon documents in FHIR systems\nFHIR documents stored elsewhere (i.e. registry/repository following the XDS model)\nPDF documents icon, Scanned Paper, and digital records of faxes\nClinical Notes in various forms\nImage files (e.g., JPEG, GIF, TIFF)\nVideo files (e.g., MP4, WMV)\nAudio files (e.g., WAV, MP3)\nNon-Standard formats (e.g., CSV, RTF, WORD)\nOther kinds of documents, such as records of prescriptions or immunizations. This resource captures data that might not be in FHIR format. The document can be any object (e.g. file), and is not limited to the formal HL7 definitions of Document. This resource may be a report with unstructured text or a report that is not expressed in a DiagnosticReport. The DiagnosticReport is appropriate to reflect a set of discrete results (Observations) and associated contextual details for a specific report, and within those results any further structure within the Observation instances. The DocumentReference resource may be an Observation whose value is audio, video or image data. This resource is the preferred representation of such forms of information as it exposes the metadata relevant for interpreting the information. There is some overlap potential such as a scan of a CBC report that can either be referenced by way of a DocumentReference, or included in a DiagnosticReport as a presentedForm together with the structured, discrete data. Specific implementation guides would further clarify when one approach is more appropriate than another.\n\nThis resource is able to contain medical images in a DICOM format. These images may also be made accessible through an ImagingStudy resource, which provides a direct reference to the image to a WADO-RS server. For such images, the WADO-RS framework is a preferred method for representing the images - the WADO-RS service may include rendering the image with annotations and display parameters from an associated DICOM presentation state, for instance. On the other hand, the DocumentReference resource allows for a robust transfer of an image across boundaries where the WADO-RS service is not available. For this reason, medical images can also be represented in a DocumentReference resource, but the DocumentReference.content.attachment.url should provide a reference to a source WADO-RS service for the image.\n\nFHIR defines both a document format and this document reference. FHIR documents are for documents that are authored and assembled in FHIR. DocumentReference is intended for general references to any type of media file including assembled documents.\n\nThe document that is a target of the reference can be a reference to a FHIR document served by another server, or the target can be stored in the special FHIR Binary Resource, or the target can be stored on some other server system. The document reference is also able to address documents that are retrieved by a service call such as an XDS.b RetrieveDocumentSet, or a DICOM exchange, or an HL7 V2 icon message query - though the way each of these service calls works must be specified in some external standard or other documentation.\n\nA DocumentReference describes some other document. This means that there are two sets of provenance information relevant here: the provenance of the document, and the provenance of the document reference. Sometimes, the provenance information is closely related, as when the document producer also produces the document reference, but in other workflows, the document reference is generated later by other actors. In the DocumentReference resource, the meta content refers to the provenance of the reference itself, while the content described below concerns the document it references. Like all resources, there is overlap between the information in the resource directly, and in the general Provenance resource. This is discussed as part of the description of the Provenance resource.", "structure": { "resourceType": "DocumentReference", "identifier": [ { "Identifier": {} } ], "version": "<string>", "basedOn": [ { "Reference": "Appointment|AppointmentResponse|CarePlan|Claim|CommunicationRequest|Contract|CoverageEligibilityRequest|DeviceRequest|EnrollmentRequest|ImmunizationRecommendation|MedicationRequest|NutritionOrder|RequestOrchestration|ServiceRequest|SupplyRequest|VisionPrescription" } ], "status": "<code>", "docStatus": "<code>", "modality": [ { "CodeableConcept": {} } ], "type": { "CodeableConcept": {} }, "category": [ { "CodeableConcept": {} } ], "subject": { "Reference": "Any" }, "context": [ { "Reference": "Appointment|Encounter|EpisodeOfCare" } ], "event": [ { "CodeableReference": {} } ], "bodySite": [ { "CodeableReference": "BodyStructure" } ], "facilityType": { "CodeableConcept": {} }, "practiceSetting": { "CodeableConcept": {} }, "period": { "Period": {} }, "date": "<instant>", "author": [ { "Reference": "CareTeam|Device|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson" } ], "attester": [ { "mode": { "CodeableConcept": {} }, "time": "<dateTime>", "party": { "Reference": "Organization|Patient|Practitioner|PractitionerRole|RelatedPerson" } } ], "custodian": { "Reference": "Organization" }, "relatesTo": [ { "code": { "CodeableConcept": {} }, "target": { "Reference": "DocumentReference" } } ], "description": "<markdown>", "securityLabel": [ { "CodeableConcept": {} } ], "content": [ { "attachment": { "Attachment": {} }, "profile": [ { "valueCoding": { "Coding": {} } }, { "valueUri": "<uri>" }, { "valueCanonical": "<canonical>" } ] } ] } }
{"resource": "DiagnosticReport", "description": "The DiagnosticReport resource in FHIR serves as a comprehensive framework for documenting the outcomes of diagnostic services once investigations are complete. It encompasses a variety of data types including atomic results, textual summaries, images, and coded interpretations, depending on the nature of the diagnostic procedure and the specific outcomes observed. This resource is structured to facilitate the representation of clinical context alongside detailed findings, making it suitable for various diagnostic scenarios such as laboratory tests (Clinical Chemistry, Hematology, Microbiology), pathology and histopathology examinations, imaging investigations (x-ray, CT, MRI), and other specialized diagnostics like cardiology and gastroenterology. Each DiagnosticReport entry contains essential metadata about the report itself, the subject (patient), and often details about the specimen if applicable, linking back to the request for the diagnostic investigation. Reports may include conclusions presented as simple text summaries, structured coded data, or fully formatted reports such as PDFs, ensuring flexibility in how results are conveyed. It is important to note that the DiagnosticReport resource does not aim to support cumulative result presentations or detailed structured reports of sequencing in its current version, though plans for future updates may include these capabilities. The resource distinguishes itself from the Observation resource by its ability to provide richer clinical context and aggregated findings, which may include nested structures of Observations (traditionally known as panels or batteries in laboratory settings) to depict relationships between individual data items. For complex imaging studies or genomic data, the DiagnosticReport references related studies through the study element, linking to ImagingStudy resources for DICOM imaging or GenomicStudy resources for genomic analyses. Images and media associated with the report can be referenced directly through the media element, enriching the comprehensive data representation within the resource. In contrast to DocumentReference, which typically points to non-FHIR objects like scanned documents or narrative notes, DiagnosticReport focuses on discrete results and associated contextual details within a FHIR-compliant framework. Implementation guides further clarify when to use DocumentReference versus DiagnosticReport based on specific use case requirements, ensuring appropriate utilization across healthcare workflows.", "structure": { "resourceType": "DiagnosticReport", "identifier": [ { "Identifier": {} } ], "basedOn": [ { "Reference": "CarePlan|ImmunizationRecommendation|MedicationRequest|NutritionOrder|ServiceRequest" } ], "status": "<code>", "category": [ { "CodeableConcept": {} } ], "code": { "CodeableConcept": {} }, "subject": { "Reference": "BiologicallyDerivedProduct|Device|Group|Location|Medication|Organization|Patient|Practitioner|Substance" }, "encounter": { "Reference": "Encounter" }, "effectiveDateTime": "<dateTime>", "effectivePeriod": { "Period": {} }, "issued": "<instant>", "performer": [ { "Reference": "CareTeam|Organization|Practitioner|PractitionerRole" } ], "resultsInterpreter": [ { "Reference": "CareTeam|Organization|Practitioner|PractitionerRole" } ], "specimen": [ { "Reference": "Specimen" } ], "result": [ { "Reference": "Observation" } ], "note": [ { "Annotation": {} } ], "study": [ { "Reference": "GenomicStudy|ImagingStudy" } ], "supportingInfo": [ { "type": { "CodeableConcept": {} }, "reference": { "Reference": "Citation|DiagnosticReport|Observation|Procedure" } } ], "media": [ { "comment": "<string>", "link": { "Reference": "DocumentReference" } } ], "composition": { "Reference": "Composition" }, "conclusion": "<markdown>", "conclusionCode": [ { "CodeableConcept": {} } ], "presentedForm": [ { "Attachment": {} } ] } }
{"resource": "Specimen", "description": "Any material sample:\n\n- taken from a biological entity, living or dead\n- taken from a physical object or the environment\n\nSome specimens are biological and can contain one or more components including but not limited to cellular molecules, cells, tissues, organs, body fluids, embryos, and body excretory products (source: NCI Thesaurus icon, modified).\n\nThe specimen resource covers substances used for diagnostic and environmental testing. The focus of the specimen resource is the process for gathering, maintaining and processing the specimen as well as where the specimen originated. This is distinct from the use of Substance which is only used when these other aspects are not relevant. The current definition of the specimen resource contains only basic information about specimen containers. It does not address the recursive nature of containers or the tracking of the location of a container within its parent container (for instance: a tube in a tray in a rack in a freezer). The frequency with which these elements are tracked may depend on the context of use; general lab, bio-banking, etc. Comments from reviewers on the appropriate scope for this resource, and the need for tracking related specimen management attributes, are welcomed.", "structure": { "resourceType": "Specimen", "identifier": [ { "Identifier": {} } ], "accessionIdentifier": { "Identifier": {} }, "status": "<code>", "type": { "CodeableConcept": {} }, "subject": { "Reference": "BiologicallyDerivedProduct|Device|Group|Location|Patient|Substance" }, "receivedTime": "<dateTime>", "parent": [ { "Reference": "Specimen" } ], "request": [ { "Reference": "ServiceRequest" } ], "combined": "<code>", "role": [ { "CodeableConcept": {} } ], "feature": [ { "type": { "CodeableConcept": {} }, "description": "<string>" } ], "collection": { "collector": { "Reference": "Patient|Practitioner|PractitionerRole|RelatedPerson" }, "collectedDateTime": "<dateTime>", "collectedPeriod": { "Period": {} }, "duration": { "Duration": {} }, "quantity": { "Quantity": { "SimpleQuantity": {} } }, "method": { "CodeableConcept": {} }, "device": { "CodeableReference": { "Device": {} } }, "procedure": { "Reference": "Procedure" }, "bodySite": { "CodeableReference": { "BodyStructure": {} } }, "fastingStatusCodeableConcept": { "CodeableConcept": {} }, "fastingStatusDuration": { "Duration": {} } }, "processing": [ { "description": "<string>", "method": { "CodeableConcept": {} }, "additive": [ { "Reference": "Substance" } ], "timeDateTime": "<dateTime>", "timePeriod": { "Period": {} } } ], "container": [ { "device": { "Reference": "Device" }, "location": { "Reference": "Location" }, "specimenQuantity": { "Quantity": { "SimpleQuantity": {} } } } ], "condition": [ { "CodeableConcept": {} } ], "note": [ { "Annotation": {} } ] } }
{"resource": "BodyStructure", "description": "The BodyStructure resource contains details about the anatomical location of a specimen or body part, including patient information, identifiers, as well as text descriptions and images. When needed, it allows the representation of complex body structures and/or locations using the included and excluded elements. Also, it provides for the addition of qualifiers such as laterality and directionality to the anatomic location for those use cases where pre-coordination of codes is not possible. The BodyStructure resource supports recording and tracking of an anatomic location or structure on a patient outside the context of another resource. For example, it can be the target of a Procedure or Observation resource. The BodyStructure resource is not intended to substitute for precoordination of codes. If precoordination of codes is supported by an implementation, the codeableConcept should be used. This resource is not intended for describing the type of anatomical location but rather a specific body site on a specific patient.", "structure": { "resourceType": "BodyStructure", "identifier": [ { "Identifier": {} } ], "active": true, "morphology": { "CodeableConcept": {} }, "includedStructure": [ { "structure": { "CodeableConcept": {} }, "laterality": { "CodeableConcept": {} }, "bodyLandmarkOrientation": [ { "landmarkDescription": [ { "CodeableConcept": {} } ], "clockFacePosition": [ { "CodeableConcept": {} } ], "distanceFromLandmark": [ { "device": [ { "CodeableReference": { "Device": {} } } ], "value": [ { "Quantity": {} } ] } ], "surfaceOrientation": [ { "CodeableConcept": {} } ] } ], "spatialReference": [ { "Reference": "ImagingSelection" } ], "qualifier": [ { "CodeableConcept": {} } ] } ], "excludedStructure": [ { "structure": { "CodeableConcept": {} }, "laterality": { "CodeableConcept": {} }, "bodyLandmarkOrientation": [ { "landmarkDescription": [ { "CodeableConcept": {} } ], "clockFacePosition": [ { "CodeableConcept": {} } ], "distanceFromLandmark": [ { "device": [ { "CodeableReference": { "Device": {} } } ], "value": [ { "Quantity": {} } ] } ], "surfaceOrientation": [ { "CodeableConcept": {} } ] } ], "spatialReference": [ { "Reference": "ImagingSelection" } ], "qualifier": [ { "CodeableConcept": {} } ] } ], "description": "<markdown>", "image": [ { "Attachment": {} } ], "patient": { "Reference": "Patient" } } }
{"resource": "ImagingStudy", "description": "ImagingStudy provides information on a DICOM imaging study, and the series and imaging objects in that study. It also provides information on how to retrieve that information (in a native DICOM format, or in a rendered format, such as JPEG). ImagingStudy is used to make available information about all parts of a single DICOM study.\n\nThis resource provides mappings of its elements to DICOM attributes. DICOM attributes are identified by a 32-bit tag, presented in canonical form as two four-digit hexadecimal values within parentheses and separated by a comma, e.g. (0008,103E). The name and value representation (data type) of each attribute can be found in DICOM Part 6 Data Dictionary icon. The use of the attributes in the context of information objects, including detailed description of use, can be found in DICOM Part 3 Information Object Definitions icon. Attributes used in the DICOM query information models, such as 'Number of Instances in Study', can be found in DICOM Part 4 Annex C icon.\n\nImagingStudy provides access to significant DICOM information but will only eliminate the need for DICOM query (e.g., QIDO-RS) in the simplest cases. The DICOM instances are not stored in the ImagingStudy resource; use of a DICOM WADO-RS server or other storage mechanism is needed.\n\nAn ImagingStudy SHALL reference one DICOM Study, and MAY reference a subset of that Study. More than one ImagingStudy MAY reference the same DICOM Study or different subsets of the same DICOM Study. Use the ImagingStudy resource to store details of an entire DICOM Study and associated information.\n\nUse the DocumentReference resource to store non-DICOM images, video, or audio with relevant metadata.\n\nUse the Binary resource to store arbitrary content.\n\nUse the ImagingSelection resource to store a reference to a specific set of DICOM images, frames or other DICOM instances.", "structure": {"resourceType": "ImagingStudy","identifier": [{"Identifier": {}}],"status": "<code>","modality": [{"CodeableConcept": {}}],"subject": {"Reference": "Device|Group|Patient"},"encounter": {"Reference": "Encounter"},"started": "<dateTime>","basedOn": [{"Reference": "Appointment|AppointmentResponse|CarePlan|ServiceRequest|Task"}],"partOf": [{"Reference": "Procedure"}],"referrer": {"Reference": "Practitioner|PractitionerRole"},"endpoint": [{"Reference": "Endpoint"}],"numberOfSeries": "<unsignedInt>","numberOfInstances": "<unsignedInt>","procedure": [{"CodeableReference": {"ActivityDefinition": {},"PlanDefinition": {}}}],"location": {"Reference": "Location"},"reason": [{"CodeableReference": {"Condition": {},"DiagnosticReport": {},"DocumentReference": {},"Observation": {}}}],"note": [{"Annotation": {}}],"description": "<string>","series": [{"uid": "<id>","number": "<unsignedInt>","modality": {"CodeableConcept": {}},"description": "<string>","numberOfInstances": "<unsignedInt>","endpoint": [{"Reference": "Endpoint"}],"bodySite": {"CodeableReference": {"BodyStructure": {}}},"laterality": {"CodeableConcept": {}},"specimen": [{"Reference": "Specimen"}],"started": "<dateTime>","performer": [{"function": {"CodeableConcept": {}},"actor": {"Reference": "CareTeam|Device|HealthcareService|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson"}}],"instance": [{"uid": "<id>","sopClass": {"Coding": {}},"number": "<unsignedInt>","title": "<string>"}]}]}}
{"resource": "MolecularSequence","description": "The MolecularSequence resource is designed for representing molecular sequences. It can represent the sequence in different ways, allowing implementations to adopt the most effective one for their use case.\n\nIt is strongly encouraged to provide as much information in this resource for any reported sequences, because receiving systems (e.g. discovery research, outcomes analysis, and public health reporting) may use this information to normalize sequences over time or across sources. However, these data should not be used to dynamically correct/change sequence representations for clinical use outside of the laboratory, due to insufficient information.\n\nThe MolecularSequence resource is designed to represent a single sequence in an instance. Each sequence might have multiple representations, but implementers SHALL ensure all representations are for the same sequence. This means that if a single MolecularSequence instance contains a literal, two formatted files, and a relative, all four of those representations must represent the same sequence. This can be a challenge across systems, as semantic equivalency of sequences cannot be guaranteed unless there is an agreed upon standard between sending and receiving systems. The MolecularSequence resource should only be used to capture a molecular sequence. It will not be used for other entities such as variant, variant annotations, genotypes, haplotypes, etc. Those concepts will be captured in Observation profiles found in the Genomics Reporting Implementation Guide icon. The sequence that was observed that led to the identification of those concepts can be delivered with this resource, and will be referenced by those observations.\n\nMolecularSequence will not be used to capture data such as precise read of DNA sequences and sequence alignment are not included; such data may be accessible through references to GA4GH icon (Global Alliance for Genomics and Health) API, and may be referenced to by the formatted element.","structure": {"resourceType": "MolecularSequence","identifier": [{"Identifier": {}}],"type": "<code>","subject": {"Reference": "BiologicallyDerivedProduct|Group|NutritionProduct|Patient|Substance"},"focus": [{"Reference": "Any"}],"specimen": {"Reference": "Specimen"},"device": {"Reference": "Device"},"performer": {"Reference": "Organization"},"literal": "<string>","formatted": [{"Attachment": {}}],"relative": [{"coordinateSystem": {"CodeableConcept": {}},"ordinalPosition": "<integer>","sequenceRange": {"Range": {}},"startingSequence": {"genomeAssembly": {"CodeableConcept": {}},"chromosome": {"CodeableConcept": {}},"sequenceCodeableConcept": {"CodeableConcept": {}},"sequenceString": "<string>","sequenceReference": {"Reference": "MolecularSequence"},"windowStart": "<integer>","windowEnd": "<integer>","orientation": "<code>","strand": "<code>"},"edit": [{"start": "<integer>","end": "<integer>","replacementSequence": "<string>","replacedSequence": "<string>"}]}]}}
{"resource": "ImagingSelection","description": "This resource is an event resource from a FHIR workflow perspective - see Workflow.\n\nA selection of data from an ImagingStudy. The selection may be:\n\n- All DICOM SOP Instances in a single DICOM Series\n- A set of DICOM SOP Instances within a single DICOM Series\n- A set of frames within one or more DICOM multiframe image SOP Instances\n- A set of segments within one or more DICOM segmentation SOP Instances\n- A set of content items within one or more DICOM Structured Report SOP Instances\n\nMay also represent regions within the ImagingStudy frame of reference, including:\n\n- A 2D region within one or more DICOM image SOP Instances\n- A 3D region within a DICOM Frame of Reference\n\nUses for ImagingSelection resources include:\n\n- Identifying a specific set of images or frames as the focus of an Observation\n- Identifying a spatial region or volume as the focus of an Observation\n- Identifying the set of image coordinates as the focus of a measurement represented by an Observation\n- Identifying a node in a DICOM Structured Report SOP Instance from which an Observation is derived\n- Identifying images, frames or presentation states selected as part of shared application context in a context-sharing environment\n- Identifying a specific set of images, frames or presentation states to be presented\n\nAll DICOM SOP Instances referenced in a single ImagingSelection resource shall be part of the same DICOM Series (and therefore also the same DICOM Study). In order to reference SOP Instances in multiple Studies or Series it is necessary to create multiple ImagingSelection resources. An Observation references an ImagingSelection to specify the set of DICOM images, frames, waveforms or documents used to make the Observation. By contrast, an Observation references an ImagingStudy if it does not depend on any specific set of images, frames, waveforms or documents.\n\nAn Observation references an ImagingSelection to specify an image region corresponding to the measurement value expressed in the Observation.\n\nWhile an ImagingSelection is restricted to a single DICOM Series, a single Observation references multiple ImagingSelection resources if it relates to multiple Studies and/or Series – for example, to reference multiple images over different cardiac phases or a PET and a CT image.\n\nA DiagnosticReport might directly reference an ImagingSelection that includes one or more Observations derived from ImagingSelection resources.\n\nIn contrast with a DocumentReference, an ImagingSelection includes the ability to specify a region within an image, an observation node within a DICOM Structured Reporting (SR) and the ability to specify one or more Endpoint resources for retrieval of the referenced images, frames, waveforms or documents. Additionally, DocumentReference has limited ability to reference multiple images or frames and can only specify the Study, Series and SOP Instance UIDs implicitly via the URL.\n\nDocumentReference might be appropriate for including a rendered DICOM image in cases where the full image context is not important.","structure": {"resourceType": "ImagingSelection","identifier": [{"Identifier": {}}],"status": "<code>","subject": {"Reference": "Device|Group|Location|Medication|Organization|Patient|Practitioner|Procedure|Specimen|Substance"},"issued": "<instant>","performer": [{"function": {"CodeableConcept": {}},"actor": {"Reference": "CareTeam|Device|HealthcareService|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson"}}],"basedOn": [{"Reference": "Appointment|AppointmentResponse|CarePlan|ServiceRequest|Task"}],"category": [{"CodeableConcept": {}}],"code": {"CodeableConcept": {}},"studyUid": "<id>","derivedFrom": [{"Reference": "DocumentReference|ImagingStudy"}],"endpoint": [{"Reference": "Endpoint"}],"seriesUid": "<id>","seriesNumber": "<unsignedInt>","frameOfReferenceUid": "<id>","bodySite": {"CodeableReference": {"BodyStructure": {}}},"focus": [{"Reference": "ImagingSelection"}],"instance": [{"uid": "<id>","number": "<unsignedInt>","sopClass": {"Coding": {}},"subset": ["<string>"],"imageRegion2D": [{"regionType": "<code>","coordinate": ["<decimal>"]}],"imageRegion3D": [{"regionType": "<code>","coordinate": ["<decimal>"]}]}]}}
{"resource": "QuestionnaireResponse","description":"QuestionnaireResponse provides a complete or partial list of answers to a set of questions filled when responding to a questionnaire. The questions may be included directly or by reference to a Questionnaire resource that defines the questions as well as the constraints on the allowed answers. In some cases, both formal rules for editing the questionnaire (via link to Questionnaire) as well as sufficient local information to allow rendering of the questionnaire may be provided. Each time a questionnaire is completed for a different subject or at a different time, a distinct QuestionnaireResponse is generated, though it may be possible for a previously entered set of answers to be edited or updated. Questionnaire responses cover the need to communicate data originating from forms used in medical history examinations, research questionnaires and sometimes full clinical specialty records. In many systems this data is collected using user-defined screens and forms. Questionnaire responses record specifics about data capture - exactly what questions were asked, in what order, what answers were given, etc. Each of these questions is part of the Questionnaire, and as such the Questionnaire is a separately identifiable Resource, whereas the individual questions are not.\n\nExamples of Questionnaires include:\n- Past medical history (PMH)\n- Family diseases\n- Social history\n- Research questionnaires and Case report forms (CRFs)\n- Quality and evaluation forms\n- Patient intake form (e.g. clipboard)\n- Insurance claim form\n\nQuestionnaireResponse resources can be validated against their corresponding Questionnaire to verify that required groups and questions are answered and that answers fit constraints in terms of cardinality, data type, etc. The QuestionnaireResponse resource captures the responses to a questionnaire, while Questionnaire represents the definition of the questionnaire form, including what questions are asked, how they're organized and the constraints on the allowed answers. While Observation, with its nested component structure, can create complex hierarchies of questions and answers, the focus is different. First, Observation is used primarily for capturing data elements that are 'true' observations - lab measurements, vital signs, social assessments, etc., while QuestionnaireResponse can be used to capture any types of data, including data that would typically map to other resources (Procedure, Patient, MedicationStatement, etc.). Second, the focus of QuestionnaireResponse includes the specific phrasing and organization of the questions. All data must be explicitly captured as a question. With Observation, the focus is only on the meaning of the answer, not what question was asked (assuming a question was even asked at all). Additional information such as normal ranges, interpretation, date, etc., may also be captured.","structure":{"resourceType":"QuestionnaireResponse","identifier":[{"Identifier":{}}],"basedOn":[{"Reference":"CarePlan|ServiceRequest"}],"partOf":[{"Reference":"Observation|Procedure"}],"questionnaire":"<canonical(Questionnaire)>","status":"<code>","subject":{"Reference":"Any"},"encounter":{"Reference":"Encounter"},"authored":"<dateTime>","author":{"Reference":"Device|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson"},"source":{"Reference":"Device|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson"},"item":[{"linkId":"<string>","definition":"<uri>","text":"<string>","answer":[{"valueBoolean":"<boolean>","valueDecimal":"<decimal>","valueInteger":"<integer>","valueDate":"<date>","valueDateTime":"<dateTime>","valueTime":"<time>","valueString":"<string>","valueUri":"<uri>","valueAttachment":{"Attachment":{}},"valueCoding":{"Coding":{}},"valueQuantity":{"Quantity(SimpleQuantity)":{}},"valueReference":{"Reference":"Any"},"item":[{}]}],"item":[{}]}]}}
{"resource": "GenomicStudy","description": "GenomicStudy resource aims at delineating relevant information of a genomic study. A genomic study might comprise one or more analyses, each serving a specific purpose. These analyses may vary in method (e.g., karyotyping, CNV, or SNV detection), performer, software, devices used, or regions targeted.\n\nGenomicStudy describes relevant information including the reasons, purpose, and performers of the study. It also provides technical endpoints to access these data. It could be a logical aggregator for complex genomic analyses.\n\nA GenomicStudy might be based on one or more service requests or care plans. The reasons for performing a genomic study might be driven by specific Conditions or Observations. Although the genomic study subject is the focus of the study, the analysis-level focus could be used to specify other relevant subjects or specimens. For example, trio testing may involve three subjects: the proband, and both parents. The proband would be the subject listed directly under the genomic study, while each of the analyses could represent proband, mother, and father genomic analyses.\n\nIn clinical use, the study interpreters use all the results of these various analyses to provide diagnostic and therapeutic insights for the patient. Where performers are listed according to their participation in each genomic analysis. Each analysis may be based on a set of defined protocols that may differ from the performed protocols.\n\nThe regionStudied and regionCalled elements can refer to DocumentReference instances carrying BED files. Other types of files used in an analysis can be provided similarly, and listed either as inputs or outputs.\n\nDetailed information about the results of the analyses may be represented by Observations and gathered in a DiagnosticReport. Both resources may refer back to the originating GenomicStudy to allow navigation. A main function of GenomicStudy is to provide additional metadata for one or more clinical genomic analysis pipelines where DocumentReference instances are used to track inputs and outputs of those pipelines. Device is used to represent both hardware and software used in the sequencing and in the analyses.\n\nIt is intended that this resource be referenced by Observation and DiagnosticReport in the same way that ImagingStudy is currently referenced on those resources. Of note, the results of the study would be captured in Observations and referenced on a DiagnosticReport.\n\nImportant contextual references include Patient, Specimen, Encounter, ServiceRequest, Practitioner, and Organization.\n\nObservation or Condition instances may also be referenced from genomic study to designate a given reason for performing the study.\n\nGenomicStudy can support the event-definition workflow pattern by referencing PlanDefinition via the instantiatesCanonical relationship when implementers wish to describe more specifics of the pipelines and devices used in the analysis.","structure": {"resourceType": "GenomicStudy","identifier": [{"Identifier": {}}],"status": "<code>","type": [{"CodeableConcept": {}}],"subject": {"Reference": "BiologicallyDerivedProduct|Group|NutritionProduct|Patient|Substance"},"encounter": {"Reference": "Encounter"},"startDate": "<dateTime>","basedOn": [{"Reference": "ServiceRequest|Task"}],"referrer": {"Reference": "Practitioner|PractitionerRole"},"interpreter": [{"Reference": "Practitioner|PractitionerRole"}],"reason": [{"CodeableReference": {"Condition": {},"Observation": {}}}],"instantiatesCanonical": "<canonical(PlanDefinition)>","instantiatesUri": "<uri>","note": [{"Annotation": {}}],"description": "<markdown>","analysis": [{"identifier": [{"Identifier": {}}],"methodType": [{"CodeableConcept": {}}],"changeType": [{"CodeableConcept": {}}],"genomeBuild": {"CodeableConcept": {}},"instantiatesCanonical": "<canonical(PlanDefinition|ActivityDefinition)>","instantiatesUri": "<uri>","title": "<string>","focus": [{"Reference": "Any"}],"specimen": [{"Reference": "Specimen"}],"date": "<dateTime>","note": [{"Annotation": {}}],"protocolPerformed": {"Reference": "Procedure|Task"},"regionsStudied": [{"Reference": "DocumentReference|Observation"}],"regionsCalled": [{"Reference": "DocumentReference|Observation"}],"input": [{"file": {"Reference": "DocumentReference"},"type": {"CodeableConcept": {}},"generatedByIdentifier": {"Identifier": {}},"generatedByReference": {"Reference": "GenomicStudy"}}],"output": [{"file": {"Reference": "DocumentReference"},"type": {"CodeableConcept": {}}}],"performer": [{"actor": {"Reference": "Device|Organization|Practitioner|PractitionerRole"},"role": {"CodeableConcept": {}}}],"device": [{"device": {"Reference": "Device"},"function": {"CodeableConcept": {}}}]}]}}
{"resource": "AllergyIntolerance","description": "A record of a clinical assessment of an allergy or intolerance; a propensity, or a potential risk to an individual, to have an adverse reaction on future exposure to the specified substance, or class of substance.\n\nWhere a propensity is identified, to record information or evidence about a reaction event that is characterized by any harmful or undesirable physiological response that is specific to the individual and triggered by exposure of an individual to the identified substance or class of substance.\n\nSubstances include, but are not limited to: a therapeutic substance administered correctly at an appropriate dosage for the individual; food; material derived from plants or animals; or venom from insect stings. This resource is used to provide a single place within the health record to document a range of clinical statements about adverse reactions to substances/products, including:\n\nrecord a clinical assessment of the individual's propensity to a potential future reaction upon re-exposure\nrecord cumulative information about the reaction to each exposure, including 'no reaction' if appropriate\nUse to record information about the positive presence of the risk of an adverse reaction:\n\n  - to support direct clinical care of an individual\n  - as part of a managed adverse reaction or allergy/intolerance list\n  - to support exchange of information about the propensity and events related to adverse reactions\n  - to inform adverse reaction reporting\n  - to assist computerized knowledge-based activities such as clinical decision support and alerts\n\nUse to record information about adverse reactions to a broad range of substances, including: biological & blood products; incipients and excipients in medicinal preparations; foods; metal salts; and organic chemical compounds.\n\nAdverse reactions may be:\n\n  - an allergy (typically type I hypersensitivity, plus other 'allergy-like' reactions, including pseudoallergy)\n  - an intolerance (typically non-immune adverse reactions that are not determined or perceived to be allergic or 'allergy-like', and are to some degree idiosyncratic and/or individually specific [i.e. are not a reaction that is expected to occur with most or all patients given similar circumstances])\n\nIn clinical practice distinguishing between allergy and intolerance is difficult and might not be practical. Often the term 'allergy' is used rather generically and may overlap with 'intolerance', and the boundaries between these concepts might not be well-defined or understood. As noted above, the term 'intolerance' should generally be applied to a propensity for adverse reactions which is either determined (to the extent that is possible) or perceived to not be allergic or 'allergy-like'. If it is not possible to determine whether a particular propensity condition is an allergy or an intolerance, then the type element should be omitted from the resource. Identification of the type of reaction is not a proxy for seriousness or risk of harm to the patient, which is better expressed in the documentation of the clinical manifestation and the assessment of criticality.\n\nThe sensitivity in the case of either an allergy or intolerance is unique to the individual, and is distinguished from those reactions that are a property of the circumstance, such as toxicity of a food or drug, overdose, drug-drug, drug-food, or drug-disease interaction (which are reactions that would be expected to occur for any individual given the same circumstances).\n\nThe risk of an adverse reaction event or manifestation should not be recorded without identifying a proposed causative substance (including pharmaceutical products) or class of substance. If there is uncertainty that a specific substance is the cause, this uncertainty can be recorded using the 'verificationStatus' data element. If there are multiple possible substances that may have caused a reaction/manifestation, each substance should be recorded using a separate instance of this resource with the 'verificationStatus' set to an initial state of 'unconfirmed' so that adverse reaction checking can be supported in clinical systems. If a substance, agent or class is later proven not to be the cause for a given reaction then the 'verificationStatus' can be modified to 'refuted'.\n\nThis resource has been designed to allow recording of information about a specific substance (e.g., amoxicillin, oysters, or bee sting venom) or pharmaceutical product or, alternatively, a class of substance (e.g., penicillins). If a class of substance is recorded, then identification of the exact substance can be recorded on a per exposure basis.\n\nThe scope of this FHIR resource has deliberately focused on identifying a pragmatic data set that is used in most clinical systems or will be suitable for most common clinical scenarios; extensions can be used to add additional detail if required. Examples of clinical situations where the extension may be required include: a detailed allergist/immunologist assessment, for reporting to regulatory bodies or use in a clinical trial.\n\nThe act of recording any adverse reaction in a health record involves the clinical assessment that a potential hazard exists for an individual if they are exposed to the same substance/product/class in the future - that is, a relative contraindication - and, in the absence of additional information indicating a higher level of potential risk, the default 'criticality' value should be set to 'Low Risk'. If a clinician considers that it is not safe for the individual to be deliberately re-exposed to the substance/product again, for example, following a manifestation of a life-threatening anaphylaxis, then the 'criticality' data element should be amended to 'High Risk'.\n\nA formal adverse event report to regulatory bodies is a document that will contain a broad range of information in addition to the specific details about the adverse reaction. The report could utilize parts of this resource plus include additional data as required per jurisdiction.\n\nAn adverse reaction or allergy/intolerance list is a record of all identified propensities for an adverse reaction for the individual upon future exposure to the substance/product or class, plus provides potential access to the evidence provided by details about each reaction event, such as manifestation.\n\nValuable first-level information that could be presented to the clinician when they need to assess propensity for future reactions are:\n\n  - statements about previous clinical manifestations following exposure\n  - source of the information/reporter\n  - the 'criticality' flag\n\nSecond-level information can be drawn from each exposure event and links to additional detailed information such as history, examination and diagnoses stored elsewhere in the record, if it is available.\n\nAllergyIntolerance and RiskAssessment\n\nAllergyIntolerance describes a specific type of risk - propensity to reaction to a substance/product while RiskAssessment describes general risks to a subject, not generally based on a reaction.\n\nAllergyIntolerance and Immunization.reaction\n\nImmunization.reaction may be an indication of an allergy or intolerance. If this is deemed to be the case, a separate AllergyIntolerance record should be created to indicate it, as most systems will not query against past immunization.reactions.\n\nMisuse\n\nThe allergy/intolerance list exists as a patient safety tool to inform decision support around ordering of medications and nutrition and to guide clinical treatment. Other reactions triggered by physical stimuli -- light, heat, cold, pressure, vibration, which may mimic allergic or intolerance reactions, should be recorded as Condition on the problem list, not using AllergyIntolerance.\n\nNot to be used to record adverse events, including failures of clinical process, interventions or products. For example, abnormal use or mistakes/errors made in maladministration of an agent or substance, incorrect dosage, mislabeling, harm or injury caused by an intervention or procedure, overdose/poisoning, etc.\n\nNot to be used as a proxy for an adverse event report. See above for how it may be used as one component of an adverse event report.\n\nNot to be used for recording alerts. Alerts are handled using Flag or - where event-specific, DetectedIssue.\n\nNot to be used for recording failed therapy.","structure": {"resourceType": "AllergyIntolerance","identifier": [{"Identifier": {}}],"clinicalStatus": {"CodeableConcept": {}},"verificationStatus": {"CodeableConcept": {}},"type": {"CodeableConcept": {}},"category": ["<code>"],"criticality": "<code>","code": {"CodeableConcept": {}},"patient": {"Reference": "Patient"},"encounter": {"Reference": "Encounter"},"onset[x]": {"onsetDateTime": "<dateTime>","onsetAge": {"Age": {}},"onsetPeriod": {"Period": {}},"onsetRange": {"Range": {}},"onsetString": "<string>"},"recordedDate": "<dateTime>","participant": [{"function": {"CodeableConcept": {}},"actor": {"Reference": "CareTeam|Device|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson"}}],"lastOccurrence": "<dateTime>","note": [{"Annotation": {}}],"reaction": [{"substance": {"CodeableConcept": {}},"manifestation": [{"CodeableReference": {"Observation": {}}}],"description": "<string>","onset": "<dateTime>","severity": "<code>","exposureRoute": {"CodeableConcept": {}},"note": [{"Annotation": {}}]}]}}
{"resource": "FamilyMemberHistory","description": "FamilyMemberHistory is one of the event resources in the FHIR workflow specification.\n\nThis resource records significant health conditions for a particular individual related to the subject. This information can be known to different levels of accuracy. Sometimes the exact condition ('asthma') is known, and sometimes it is less precise ('some sort of cancer'). Equally, sometimes the person can be identified ('my aunt Agatha') and sometimes all that is known is that the person was an uncle.\n\nThis resource represents a simple structure used to capture an 'elementary' family history for a particular family member. However, it can also be the basis for capturing a more rigorous history useful for genetic and other analysis - refer to the Genetic Pedigree profile for an example.\n\nThe entire family history for an individual can be represented by combining references to FamilyMemberHistory instances into a List resource instance.","structure": {"resourceType": "FamilyMemberHistory","identifier": [{"Identifier": {}}],"instantiatesCanonical": ["<canonical(PlanDefinition|Questionnaire|ActivityDefinition|Measure|OperationDefinition)>"],"instantiatesUri": ["<uri>"],"status": "<code>","dataAbsentReason": {"CodeableConcept": {}},"patient": {"Reference": "Patient"},"date": "<dateTime>","participant": [{"function": {"CodeableConcept": {}},"actor": {"Reference": "CareTeam|Device|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson"}}],"name": "<string>","relationship": {"CodeableConcept": {}},"sex": {"CodeableConcept": {}},"born[x]": {"bornPeriod": {"Period": {}},"bornDate": "<date>","bornString": "<string>"},"age[x]": {"ageAge": {"Age": {}},"ageRange": {"Range": {}},"ageString": "<string>"},"estimatedAge": "<boolean>","deceased[x]": {"deceasedBoolean": "<boolean>","deceasedAge": {"Age": {}},"deceasedRange": {"Range": {}},"deceasedDate": "<date>","deceasedString": "<string>"},"reason": [{"CodeableReference": "AllergyIntolerance|Condition|DiagnosticReport|DocumentReference|Observation|QuestionnaireResponse"}],"note": [{"Annotation": {}}],"condition": [{"code": {"CodeableConcept": {}},"outcome": {"CodeableConcept": {}},"contributedToDeath": "<boolean>","onset[x]": {"onsetAge": {"Age": {}},"onsetRange": {"Range": {}},"onsetPeriod": {"Period": {}},"onsetString": "<string>"},"note": [{"Annotation": {}}]}],"procedure": [{"code": {"CodeableConcept": {}},"outcome": {"CodeableConcept": {}},"contributedToDeath": "<boolean>","performed[x]": {"performedAge": {"Age": {}},"performedRange": {"Range": {}},"performedPeriod": {"Period": {}},"performedString": "<string>","performedDateTime": "<dateTime>"},"note": [{"Annotation": {}}]}]}}
{"resource": "ClinicalImpression","description": "Performing a clinical assessment is a fundamental part of a clinician's workflow, performed repeatedly throughout the day. In spite of this - or perhaps, because of it - there is wide variance in how clinical impressions are recorded. Some clinical assessments simply result in an impression recorded as a single text note in the patient 'record' (e.g. 'Progress satisfactory, continue with treatment'), while others are associated with careful, detailed record keeping of the evidence gathered and the reasoning leading to a differential diagnosis, and there is a continuum between these. This resource is intended to be used to cover all these use cases.\n\nThe assessment is intimately linked to the process of care. It may occur in the context of a care plan, and it very often results in a new (or revised) care plan. Normally, clinical assessments are part of an ongoing process of care, and the patient will be re-assessed repeatedly. For this reason, the clinical impression can explicitly reference both care plans (preceding and resulting) and reference a previous impression that this impression follows.\n\nAn impression is a clinical summation of information and/or an opinion formed, which is the outcome of the clinical assessment process. The ClinicalImpression may lead to a statement of a Condition about a patient.\n\nIn FHIR, an assessment is typically an instrument or tool used to collect information about a patient. ClinicalImpression is the equivalent of the 'A' (assessment) in the SOAP note format originally described by Lawrence Weed, MD. It is the outcome of the clinical assessment process. The ClinicalImpression may lead to a statement of a Condition about a patient. There is another related clinical concept often called an 'assessment': assessment Tools such as Apgar (also known as 'Assessment Scales'). This is not what the ClinicalImpression resource is about; assessment tools such as Apgar are represented as Observations, and Questionnaires may be used to help generate these. Clinical Impressions may refer to these assessment tools as one of the investigations that was performed during the assessment process.","structure": {"resourceType": "ClinicalImpression","identifier": [{"Identifier": {}}],"status": "<code>","statusReason": {"CodeableConcept": {}},"description": "<string>","subject": {"Reference": "Group|Patient"},"encounter": {"Reference": "Encounter"},"effective[x]": {"effectiveDateTime": "<dateTime>","effectivePeriod": {"Period": {}}},"date": "<dateTime>","performer": {"Reference": "Practitioner|PractitionerRole"},"previous": {"Reference": "ClinicalImpression"},"problem": [{"Reference": "AllergyIntolerance|Condition"}],"changePattern": {"CodeableConcept": {}},"protocol": ["<uri>"],"summary": "<string>","finding": [{"item": {"CodeableReference": "Condition|DocumentReference|Observation"},"basis": "<string>"}],"prognosisCodeableConcept": [{"CodeableConcept": {}}],"prognosisReference": [{"Reference": "RiskAssessment"}],"supportingInfo": [{"Reference": "Any"}],"note": [{"Annotation": {}}]}}
{"resource": "DetectedIssue","description": "This resource applies to various circumstances where there is a concern about an existing or proposed set of clinical activity. The issue could relate to single, proposed, or multiple actions. It does not apply to technical issues (e.g. lack of user permissions) but could relate to violation of patient consent limitations. Examples include: Drug-drug interactionsInappropriate therapy (wrong dose, frequency, body site)Duplicate therapyGaps in careThis resource represents a specific instance of a potential issue for a particular patient. It is not intended to represent general patient-independent knowledge, the ClinicalUseDefinition resource is defined for that purpose. This resource is also not intended to be used in defining general prohibitions on actions such as 'No NSAIDs', 'No solid oral dose forms' or 'No MRIs - metallic tattoos'. These guidelines can be captured using the AllergyIntolerance, AdverseEvent and/or Flag resources. Similarly, this resource is not to be used to capture clinical facts that may imply contraindications such as pregnancy, breast feeding, patient preferences, past procedures, etc. These would be represented using Condition, Procedure or other resources. This resource only applies to documenting a risk associated with a specific planned or ongoing action, or the lack of an action which should be planned - not a general propensity to risk. The latter would be handled using AllergyIntolerance for substance-specific issues or Flag for other types of issues. In addition, the resource represents patient-specific and time-bound risk manifestations, not generic knowledge statements about risks that can exist. This resource is limited to clinical issues associated with a proposed or ongoing action. It does not cover technical issues such as lack of permission, duplicate identifiers, insufficient data, and other business rule violations. Technical issues are conveyed using the OperationOutcome resource. It is possible to have both OperationOutcome and DetectedIssue together, where the OperationOutcome might indicate that a requested action was rejected due to a clinical issue and the DetectedIssue provides the details of the issue. Detected issues are typically identified by decision support systems. However, they may also be captured directly by clinicians. The latter typically happens for one of two reasons:A clinician wishes to communicate an issue to another clinician whose responsibility would be to resolve it (e.g. a pharmacist identifying an issue with a prescription prior to putting it on hold)A clinician wishes to pre-emptively identify that an issue is known and is being managed (to avoid red flags being raised as part of downstream workflow); e.g. Submitting a new order and including a link to a 'duplicate therapy' issue with mitigation indicating that the therapy is not considered to be duplicate.Decision-support generated issues can result from calling a decision-support engine directly (e.g. via a custom OperationDefinition) or as part of an attempt to perform some other function (creating an order, submitting an insurance claim, capturing a medication list). When the issues are generated as a by-product of performing some other sort of action, they may be included in the 'response' to the requested action in the same manner as an OperationOutcome. In fact, both may be present - the OperationOutcome indicating that there was a warning or error associated with the request and a DetectedIssue providing the clinical details. (The OperationOutcome could point to the DetectedIssue via an extension.) In those circumstances where requested operations are rejected as a result of a detected issue, the workflow may support allowing the operation to be re-tried, provided that the identified issue is included as part of the submission (possibly also including a mitigation). In doing so, the sender acknowledges the issue and takes responsibility for it, thus allowing the requested operation to proceed. See Linking to Detected Issues for guidance on how a DetectedIssue instance might be included as part of another operation.Systems that require such workflows should document expected behavior as part of their CapabilityStatement declarations.","structure": {"resourceType": "DetectedIssue","identifier": [{"Identifier": {}}],"status": "<code>","category": [{"CodeableConcept": {}}],"code": {"CodeableConcept": {}},"severity": "<code>","subject": {"Reference": "BiologicallyDerivedProduct|Device|Group|Location|Medication|NutritionProduct|Organization|Patient|Practitioner|Procedure|Substance"},"encounter": {"Reference": "Encounter"},"identified[x]": {"identifiedDateTime": "<dateTime>","identifiedPeriod": {"Period": {}}},"author": {"Reference": "Device|Patient|Practitioner|PractitionerRole|RelatedPerson"},"implicated": [{"Reference": "Any"}],"evidence": [{"code": [{"CodeableConcept": {}}],"detail": [{"Reference": "Any"}]}],"detail": "<markdown>","reference": "<uri>","mitigation": [{"action": {"CodeableConcept": {}},"date": "<dateTime>","author": {"Reference": "Practitioner|PractitionerRole"},"note": [{"Annotation": {}}]}]}}
{"resource": "MedicationStatement","description": "The MedicationStatement resource records comprehensive assertions about a patient's medication history, encompassing current, past, or future medications based on clinical records or patient-reported information. Unlike other medication-related resources, it does not involve prescribing, dispensing, or administering medications directly but rather serves as a broader assertion of medication use. Key elements include medication status, category, effective date/time, source information, reasons for medication use, dosage details, adherence codes, and related clinical information. It supports holistic medication management by providing a consolidated view of a patient's medication history.","structure": {"resourceType": "MedicationStatement","identifier": [{"Identifier": {}}],"partOf": [{"Reference": "MedicationStatement|Procedure"}],"status": "<code>","category": [{"CodeableConcept": {}}],"medication": {"CodeableReference": "Medication"},"subject": {"Reference": "Group|Patient"},"encounter": {"Reference": "Encounter"},"effective[x]": {"effectiveDateTime": "<dateTime>","effectivePeriod": {"Period": {}},"effectiveTiming": {"Timing": {}}},"dateAsserted": "<dateTime>","informationSource": [{"Reference": "Organization|Patient|Practitioner|PractitionerRole|RelatedPerson"}],"derivedFrom": [{"Reference": "Any"}],"reason": [{"CodeableReference": "Condition|DiagnosticReport|Observation"}],"note": [{"Annotation": {}}],"relatedClinicalInformation": [{"Reference": "Condition|Observation"}],"renderedDosageInstruction": "<markdown>","dosage": [{"Dosage": {}}],"adherence": {"code": {"CodeableConcept": {}},"reason": {"CodeableConcept": {}}}}}
{"resource": "MedicationKnowledge","description": "The MedicationKnowledge resource supports detailed medication information beyond identification for prescribing or administering. It includes attributes such as classifications, images, costs, and coverages, useful for formularies or catalogs. Key features encompass medication names, associated medications, product types, preparation instructions, cost details, monitoring programs, and indication guidelines. It provides comprehensive monographs sourced from documents and guidelines, supporting informed decision-making in medication management and formulary development. It facilitates integration with healthcare systems for efficient querying and management of medication knowledge.","structure": {"resourceType": "MedicationKnowledge","identifier": [{"Identifier": {}}],"code": {"CodeableConcept": {}},"status": "<code>","author": {"Reference": "Organization"},"intendedJurisdiction": [{"CodeableConcept": {}}],"name": ["<string>"],"relatedMedicationKnowledge": [{"type": {"CodeableConcept": {}},"reference": [{"Reference": "MedicationKnowledge"}]}],"associatedMedication": [{"Reference": "Medication"}],"productType": [{"CodeableConcept": {}}],"monograph": [{"type": {"CodeableConcept": {}},"source": {"Reference": "DocumentReference"}}],"preparationInstruction": "<markdown>","cost": [{"effectiveDate": [{"Period": {}}],"type": {"CodeableConcept": {}},"source": "<string>","costMoney": {"Money": {}},"costCodeableConcept": {"CodeableConcept": {}}}],"monitoringProgram": [{"type": {"CodeableConcept": {}},"name": "<string>"}],"indicationGuideline": [{"indication": [{"CodeableReference": "ClinicalUseDefinition"}],"dosingGuideline": [{"treatmentIntent": {"CodeableConcept": {}},"dosage": [{"type": {"CodeableConcept": {}},"dosage": [{"Dosage": {}}]}],"administrationTreatment": {"CodeableConcept": {}},"patientCharacteristic": [{"type": {"CodeableConcept": {}},"valueCodeableConcept": {"CodeableConcept": {}},"valueQuantity": {"Quantity": {}},"valueRange": {"Range": {}}}]}]}],"medicineClassification": [{"type": {"CodeableConcept": {}},"sourceString": "<string>","sourceUri": "<uri>","classification": [{"CodeableConcept": {}}]}],"packaging": [{"cost": [{"Content as for MedicationKnowledge.cost": {}}],"packagedProduct": {"Reference": "PackagedProductDefinition"}}],"clinicalUseIssue": [{"Reference": "ClinicalUseDefinition"}],"storageGuideline": [{"reference": "<uri>","note": [{"Annotation": {}}],"stabilityDuration": {"Duration": {}},"environmentalSetting": [{"type": {"CodeableConcept": {}},"valueQuantity": {"Quantity": {}},"valueRange": {"Range": {}},"valueCodeableConcept": {"CodeableConcept": {}}}]}],"regulatory": [{"regulatoryAuthority": {"Reference": "Organization"},"substitution": [{"type": {"CodeableConcept": {}},"allowed": true}],"schedule": [{"CodeableConcept": {}}],"maxDispense": {"quantity": {"Quantity(SimpleQuantity)": {}},"period": {"Duration": {}}}}],"definitional": {"definition": [{"Reference": "MedicinalProductDefinition"}],"doseForm": {"CodeableConcept": {}},"intendedRoute": [{"CodeableConcept": {}}],"ingredient": [{"item": {"CodeableReference": "Substance"},"type": {"CodeableConcept": {}},"strengthRatio": {"Ratio": {}},"strengthCodeableConcept": {"CodeableConcept": {}},"strengthQuantity": {"Quantity": {}}}],"drugCharacteristic": [{"type": {"CodeableConcept": {}},"valueCodeableConcept": {"CodeableConcept": {}},"valueString": "<string>","valueQuantity": {"Quantity(SimpleQuantity)": {}},"valueBase64Binary": "<base64Binary>","valueAttachment": {"Attachment": {}}}]}}}
{"resource": "Immunization","description": "The Immunization resource is intended to cover the recording of current and historical administration of vaccines to patients across all healthcare disciplines in all care settings and all regions. This includes immunization of both humans and animals but does not include the administration of non-vaccine agents, even those that may have or claim to have immunological effects. While the terms 'immunization' and 'vaccination' are not clinically identical, for the purposes of the FHIR resources, the terms are used synonymously.\n\nAdditionally, the Immunization resource is expected to cover key concepts related to the creation, revision and querying of a patient's immunization history. This resource - through consultation with the Public Health work group - is believed to meet key use cases and information requirements as defined in the existing HL7 V2 icon immunization implementation guide, HL7 v3 icon POIZ domain and Immunization Domain Analysis Model. Administration of vaccines is intended to be handled using the Immunization resource. MedicationAdministration is intended for tracking the administration of non-vaccine medications. Some systems treat immunizations in the same way as any other medication administration. Such systems SHOULD use an immunization resource to represent these. If systems need to use a MedicationAdministration resource to capture vaccinations for workflow or other reasons, they SHOULD also expose an equivalent Immunization instance.\n\nWhile the Immunization and MedicationAdministration resources are distinct, they are both able to capture specific details of the administered product. The Immunization resource uses Immunization.vaccineCode to indicate the nature of the vaccine administered to the patient. The Immunization.administeredProduct may additionally be used to identify the specific product used (either as a coded value or as a reference to a Medication resource). The Immunization resource also contains data about the administered vaccine including the manufacturer, lot number and expiration date. However, the data elements contained within Immunization are expected to only be used when Immunization.administeredProduct does not reference a Medication resource which contains the same information about the product.\n\nSimilarly, MedicationAdministrative.medication references a Medication resource which is used to identify the administered product. Medication.marketingAuthorizationHolder, Medication.batch.lotNumber and Medication.batch.expirationDate are all analogous to the Immunization resource elements and are similarly used to capture details of the administered product.\n\nImmunization.reaction may be an indication of an allergy or intolerance. If this is deemed to be the case, a separate AllergyIntolerance resource instance should be created to indicate it, as most systems will not query against past Immunization.reaction.\n\nSome workflows may require documenting that specific educational materials were presented to the patient (or other responsible party) at the time of or before the immunization event. Conveyance of this information should be accomplished using the Communication resource. This resource can be linked to an Immunization resource and indicate the timing and nature of the educational material provided. The Communication resource may be a standalone resource or may be contained within the Immunization resource as appropriate. Feedback on this approach is welcome.","structure": {"resourceType": "Immunization","identifier": [{"Identifier": {}}],"basedOn": [{"Reference": "CarePlan|ImmunizationRecommendation|MedicationRequest|ServiceRequest"}],"status": "<code>","statusReason": {"CodeableConcept": {}},"vaccineCode": {"CodeableConcept": {}},"administeredProduct": {"CodeableReference": "Medication"},"manufacturer": {"CodeableReference": "Organization"},"lotNumber": "<string>","expirationDate": "<date>","patient": {"Reference": "Patient"},"encounter": {"Reference": "Encounter"},"supportingInformation": [{"Reference": "Any"}],"occurrenceDateTime": "<dateTime>","occurrenceString": "<string>","primarySource": true,"informationSource": {"CodeableReference": "Organization|Patient|Practitioner|PractitionerRole|RelatedPerson"},"location": {"Reference": "Location"},"site": {"CodeableConcept": {}},"route": {"CodeableConcept": {}},"doseQuantity": {"Quantity": {"SimpleQuantity": {}}},"performer": [{"function": {"CodeableConcept": {}},"actor": {"Reference": "Organization|Patient|Practitioner|PractitionerRole|RelatedPerson"}}],"note": [{"Annotation": {}}],"reason": [{"CodeableReference": "Condition|DiagnosticReport|Observation"}],"isSubpotent": true,"subpotentReason": [{"CodeableConcept": {}}],"programEligibility": [{"program": {"CodeableConcept": {}},"programStatus": {"CodeableConcept": {}}}],"fundingSource": {"CodeableConcept": {}},"reaction": [{"date": "<dateTime>","manifestation": {"CodeableReference": "Observation"},"reported": true}],"protocolApplied": [{"series": "<string>","authority": {"Reference": "Organization"},"targetDisease": [{"CodeableConcept": {}}],"doseNumber": "<string>","seriesDoses": "<string>"}]}}
{"resource": "ImmunizationEvaluation","description": " The ImmunizationEvaluation resource is intended to cover communicating the results of an evaluation of a vaccine administration event (documented using the Immunization resource) against a set of published recommendations (protocols). Evaluating administered doses in a patient's immunization history is central to ensuring that the patient is fully protected against vaccine-preventable diseases. It is also a necessary prerequisite to generating a customized set of immunization recommendations for the patient. The ImmunizationEvaluation resource communicates the results of an evaluation of an instance of the Immunization resource relative to a set of published recommendations. It is intended to communicate if the vaccine administration event was 'valid' or 'not valid' relative to the recommendations. Once all vaccine administration events in a patient's record have been evaluated, it is then possible to generate a set of vaccination related recommendations, unique for the patient. These recommendations are communicated using the ImmunizationRecommendation resource.\n\nAs the ImmunizationEvaluation resource is focused on the evaluation of a single vaccine administration event, it does not include data regarding the overall patient status relative to the recommendations used in the evaluation. For example, a total of 3 doses of hepatitis B vaccine may be required for patient protection, but an instance of the ImmunizationEvaluation resource will be concerned with only one of the doses (although other instances of ImmunizationEvaluation should exist for the other doses). The ImmunizationRecommendation resource is used to convey the overall patient status (e.g. a dose is due or the patient is complete) relative to the hepatitis B series.","structure": {"resourceType": "ImmunizationEvaluation","identifier": [{"Identifier": {}}],"status": "<code>","patient": {"Reference": "Patient"},"date": "<dateTime>","authority": {"Reference": "Organization"},"targetDisease": {"CodeableConcept": {}},"immunizationEvent": {"Reference": "Immunization"},"doseStatus": {"CodeableConcept": {}},"doseStatusReason": [{"CodeableConcept": {}}],"description": "<markdown>","series": "<string>","doseNumber": "<string>","seriesDoses": "<string>"}}
{"resource": "ImmunizationRecommendation","description": "The ImmunizationRecommendation resource is intended to cover communication of a specified patient's immunization recommendations and status across all healthcare disciplines in all care settings and all regions. The set of customized (for the patient) recommendations is based on the comparison of the patient's immunization history with a set of published recommendations (protocols).\n\nAdditionally, the ImmunizationRecommendation resource is expected to cover key concepts related to the querying of a patient's immunization recommendations and status. This resource - through consultation with the Public Health work group - is believed to meet key use cases and information requirements as defined in the existing HL7 v3 icon POIZ domain and Immunization Domain Analysis Model.","structure": {"resourceType": "ImmunizationRecommendation","identifier": [{"Identifier": {}}],"patient": {"Reference": "Patient"},"date": "<dateTime>","authority": {"Reference": "Organization"},"recommendation": [{"vaccineCode": [{"CodeableConcept": {}}],"targetDisease": [{"CodeableConcept": {}}],"contraindicatedVaccineCode": [{"CodeableConcept": {}}],"forecastStatus": {"CodeableConcept": {}},"forecastReason": [{"CodeableConcept": {}}],"dateCriterion": [{"code": {"CodeableConcept": {}},"value": "<dateTime>"}],"description": "<markdown>","series": "<string>","doseNumber": "<string>","seriesDoses": "<string>","supportingImmunization": [{"Reference": "Immunization"},{"Reference": "ImmunizationEvaluation"}],"supportingPatientInformation": [{"Reference": "Any"}]}]}}
{"resource": "FormularyItem","description":"A FormularyItem is a product or service that is available through a program and includes the conditions and constraints of availability, e.g. amount limits, categorization, cost limits, and other requirements for use. This resource describes the program-specific information for a product or service. This information is specific to the inclusion of the item in the formulary and is not inherent to the item itself.\n\nThis diagram was created for the PDEX US Drug Formulary Implementation Guide but it shows where FormularyItem would fit in a drug context. If you abstract that to generic Insurance Plans to the left and to a set of resources that can be referenced to the right, that is the concept behind the FormularyItem resource.","structure":{"resourceType":"FormularyItem","identifier":[{"Identifier":{}}],"code":{"CodeableConcept":{}},"status":"<code>"}}
{"resource": "CarePlan", "description": "CarePlan is one of the request resources in the FHIR workflow specification.\n\nCare Plans are used in many areas of healthcare with a variety of scopes. They can be as simple as a general practitioner keeping track of when their patient is next due for a tetanus immunization through to a detailed plan for an oncology patient covering diet, chemotherapy, radiation, lab work and counseling with detailed timing relationships, pre-conditions and goals. They may be used in veterinary care or clinical research to describe the care of a herd or other collection of animals. In public health, they may describe education or immunization campaigns.\n\nThis resource takes an intermediate approach to complexity. It captures basic details about who is involved and what actions are intended without dealing in discrete data about dependencies and timing relationships. These can be supported where necessary using the extension mechanism.\n\nThe scope of care plans may vary widely. Examples include:\n\n- Multi-disciplinary cross-organizational care plans; e.g. An oncology plan including the oncologist, home nursing staff, pharmacy and others\n- Plans to manage specific disease/condition(s) (e.g. nutritional plan for a patient post bowel resection, neurological plan post head injury, prenatal plan, postpartum plan, grief management plan, etc.)\n- Decision support generated plans following specific practice guidelines (e.g. stroke care plan, diabetes plan, falls prevention, etc.)\n- Self-maintained patient or care-giver authored plans identifying their goals and an integrated understanding of actions to be taken. This does not include the legal Advance Directives, which should be represented with either the Consent resource with Consent.category = Advance Directive or with a specific request resource with intent = directive. Informal advance directives could be represented as a Goal, such as \"I want to die at home.\"\n\nThis resource can be used to represent both proposed plans (for example, recommendations from a decision support engine or returned as part of a consult report) as well as active plans. The nature of the plan is communicated by the status. Some systems may need to filter CarePlans to ensure that only appropriate plans are exposed via a given user interface. CarePlan activities can be defined using references to the various \"request\" resources. These references could be to resources with a status of \"planned\" or to an active order. It is possible for planned activities to exist (e.g. appointments) without needing a CarePlan at all. CarePlans are used when there's a need to group activities, goals and/or participants together to provide some degree of context.\n\nCarePlans can be tied to specific Conditions, however they can also be condition-independent and instead focused on a particular type of care (e.g. psychological, nutritional) or the care delivered by a particular practitioner or group of practitioners.\n\nAn ImmunizationRecommendation can be interpreted as a narrow type of CarePlan dealing only with immunization events. Where such information could appear in either resource, the immunization-specific resource is preferred.\n\nCarePlans represent a specific plan instance for a particular patient or group. It is not intended to be used to define generic plans or protocols that are independent of a specific individual or group. CarePlan represents a specific intent, not a general definition. Protocols and order sets are supported through PlanDefinition.", "structure": { "resourceType": "CarePlan", "identifier": [ { "Identifier": {} } ], "instantiatesCanonical": [ "<canonical(PlanDefinition|Questionnaire|Measure|ActivityDefinition|OperationDefinition)>" ], "instantiatesUri": [ "<uri>" ], "basedOn": [ { "Reference": "CarePlan|NutritionOrder|RequestOrchestration|ServiceRequest" } ], "replaces": [ { "Reference": "CarePlan" } ], "partOf": [ { "Reference": "CarePlan" } ], "status": "<code>", "intent": "<code>", "category": [ { "CodeableConcept": {} } ], "title": "<string>", "description": "<string>", "subject": { "Reference": "Group|Patient" }, "encounter": { "Reference": "Encounter" }, "period": { "Period": {} }, "created": "<dateTime>", "custodian": { "Reference": "CareTeam|Device|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson" }, "contributor": [ { "Reference": "CareTeam|Device|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson" } ], "careTeam": [ { "Reference": "CareTeam" } ], "addresses": [ { "CodeableReference": { "Condition": {} } } ], "supportingInfo": [ { "Reference": "Any" } ], "goal": [ { "Reference": "Goal" } ], "activity": [ { "performedActivity": [ { "CodeableReference": { "Any": {} } } ], "progress": [ { "Annotation": {} } ], "plannedActivityReference": { "Reference": "Appointment|CommunicationRequest|DeviceRequest|ImmunizationRecommendation|MedicationRequest|NutritionOrder|RequestOrchestration|ServiceRequest|SupplyRequest|Task|VisionPrescription" } } ], "note": [ { "Annotation": {} } ] } } 
{"resource": "CareTeam", "description": "The CareTeam includes all the people and organizations who plan to participate in the coordination and delivery of care and is assigned to: a single patient, or a group (such as a married couple in therapy or a support group), or an event, prior to a subject being identified (such as a code blue team or emergency response team) Care Team is not limited to practitioners, but may include other caregivers such as family members, guardians, the patient themself, or others. The Care Team, depending on where used, may include care team members specific to a particular care plan, an episode, an encounter, or may reflect all known team members across these perspectives. An individual's CareTeam can be dynamic over time, such that there can be transience of team members, such as a rehabilitation team. Care Team is distinct from Group. Group identifies an undifferentiated set of individuals who are intended to be the target of one or more clinical activities (e.g. set of clinical trial participants, set of individuals impacted by or at risk of a public health event, a herd or flock, etc.) The participants within a CareTeam are the individual members or organized group of individuals. CareTeam can be referenced by EpisodeOfCare, Encounter, or CarePlan to identify the set of individuals (and their respective roles) who are intended to be involved in providing the care defined by those resources.", "structure": { "resourceType": "CareTeam", "// from Resource": "id, meta, implicitRules, and language", "// from DomainResource": "text, contained, extension, and modifierExtension", "identifier": [ { "Identifier": {} } ], "// External Ids for this team": "", "status": "<code>", "// proposed | active | suspended | inactive | entered-in-error": "", "category": [ { "CodeableConcept": {} } ], "// Type of team": "", "name": "<string>", "// Name of the team, such as crisis assessment team": "", "subject": { "Reference": "Group|Patient" }, "// Who care team is for": "", "period": { "Period": {} }, "// Time period team covers": "", "participant": [ { "// Members of the team": "", "role": { "CodeableConcept": {} }, "// Type of involvement": "", "member": { "Reference": "CareTeam|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson" }, "// Who is involved": "", "onBehalfOf": { "Reference": "Organization" }, "// Organization of the practitioner": "", "// coverage[x]: When the member is generally available within this care team. One of these 2:": "", "coveragePeriod": { "Period": {} }, "coverageTiming": { "Timing": {} } } ], "reason": [ { "CodeableReference": { "Condition": {} } } ], "// Why the care team exists": "", "managingOrganization": [ { "Reference": "Organization" } ], "// Organization responsible for the care team": "", "telecom": [ { "ContactPoint": {} } ], "// A contact detail for the care team (that applies to all members)": "", "note": [ { "Annotation": {} } ], "// Comments made about the CareTeam": "" } } 
{"resource": "Goal", "description": "A Goal in health care services delivery is generally an expressed desired health state to be achieved by a subject of care (or family/group) over a period or at a specific point of time. This desired target health state may be achieved as a result of health care intervention(s) or resulting from natural recovery over time. For example: A goal of a plan for a condition such as a diabetes might specify desired outcome(s) (e.g. HgbA1c level =<5.6% in 3 months) as a result of interventions such as medication therapy, nutritional management and/or increased physical activity. A goal of a procedure might be to meet the intended objective of the procedure (e.g. wet-dry-dressing changes twice a day; goal: wound healed completely in 2 weeks) or to prevent an unintended complication (e.g. repositioning a patient every two hours: goal to maintain skin integrity) Goals may address the prevention of illness, cure or mitigation of a condition, prolongation of life, or mitigation of pain and discomfort. When dealing with groups, goals may also reflect health state, such as a reduction of addiction behaviors. However, they may also reflect population health objectives such as education, screening, etc. Organizational goals are typically not health state specific but may instead identify measurement targets such as infection control, cost management, patient satisfaction, etc. Goals are typically established in the context of a CarePlan. However, goals may also be directly referenced by request-type resources (e.g. MedicationRequest or ServiceRequest) by using an extension. A goal represents a specific goal instance for a particular patient, group, etc. It is not intended to be used to define types of potential goals as part of an order set or protocol definition. Protocol definitions and order sets are supported through PlanDefinition. The Goal resource is intended to be used once an order set is instantiated or assigned to a patient, which is when the potential goals become the actual goals, if not changed or deleted. Goals are often evaluated using Observations. Goal does not include the legal Advance Directives, which should be represented with the Consent resource with Consent.category = Advance Directive or a request resource with the intent = directive. Legal Advance Directives may specify clinical goals that can be represented as a Goal resource as well. Informally, advance directives could be represented as a Goal resource regardless of whether it was included in the legal Consent, such as 'I want to die at home.'", "structure": { "resourceType": "Goal", "// from Resource": "id, meta, implicitRules, and language", "// from DomainResource": "text, contained, extension, and modifierExtension", "identifier": [ { "Identifier": {} } ], "// External Ids for this goal": "", "lifecycleStatus": "<code>", "// R! proposed | planned | accepted | active | on-hold | completed | cancelled | entered-in-error | rejected": "", "achievementStatus": { "CodeableConcept": {} }, "// in-progress | improving | worsening | no-change | achieved | sustaining | not-achieved | no-progress | not-attainable": "", "category": [ { "CodeableConcept": {} } ], "// E.g. Treatment, dietary, behavioral, etc": "", "continuous": "<boolean>", "// After meeting the goal, ongoing activity is needed to sustain the goal objective": "", "priority": { "CodeableConcept": {} }, "// high-priority | medium-priority | low-priority": "", "description": { "CodeableConcept": {} }, "// R! Code or text describing goal": "", "subject": { "Reference": "Group|Organization|Patient" }, "// R! Who this goal is intended for": "", "// start[x]: When goal pursuit begins. One of these 2:": "", "startDate": "<date>", "startCodeableConcept": { "CodeableConcept": {} }, "target": [ { "// Target outcome for the goal": "", "measure": { "CodeableConcept": {} }, "// I The parameter whose value is being tracked": "", "// detail[x]: The target value to be achieved. One of these 7:": "", "detailQuantity": { "Quantity": {} }, "detailRange": { "Range": {} }, "detailCodeableConcept": { "CodeableConcept": {} }, "detailString": "<string>", "detailBoolean": "<boolean>", "detailInteger": "<integer>", "detailRatio": { "Ratio": {} }, "// due[x]: Reach goal on or before. One of these 2:": "", "dueDate": "<date>", "dueDuration": { "Duration": {} } } ], "statusDate": "<date>", "// When goal status took effect": "", "statusReason": "<string>", "// Reason for current status": "", "source": { "Reference": "CareTeam|Patient|Practitioner|PractitionerRole|RelatedPerson" }, "// Who's responsible for creating Goal?": "", "addresses": [ { "Reference": "Condition|MedicationRequest|MedicationStatement|NutritionOrder|Observation|Procedure|RiskAssessment|ServiceRequest" } ], "// Issues addressed by this goal": "", "note": [ { "Annotation": {} } ], "// Comments about the goal": "", "outcome": [ { "CodeableReference": { "Observation": {} } } ] } } 
{"resource": "ServiceRequest", "description": "ServiceRequest represents an order or proposal or plan, as distinguished by ServiceRequest.intent to perform a diagnostic or other service on or for a patient. ServiceRequest represents a proposal or plan or order for a service to be performed that would result in a Procedure or DiagnosticReport, which in turn may reference one or more Observations, which summarize the performance of the procedures and associated documentation such as observations, images, findings that are relevant to the treatment/management of the subject. This resource may be used to share relevant information required to support a referral or a transfer of care request from one practitioner or organization to another when a patient is required to be referred to another provider for a consultation/second opinion and/or for short term or longer term management of one or more health issues or problems. Examples include: diagnostic tests/studies, endoscopic procedures, counseling, biopsies, therapies (e.g., physio-, social-, psychological-), (exploratory) surgeries or procedures, exercises, specialist consultation and assessments, community services, nursing services, pharmacist medication review, and other clinical interventions. Procedures may be performed by a healthcare professional, a friend or relative or in some cases by the patient themselves. The principal intention of ServiceRequest is to support ordering procedures for one patient (which includes non-human patients in veterinary medicine). However, in many contexts, healthcare related processes include performing diagnostic investigations on groups of subjects, devices involved in the provision of healthcare, and even environmental locations such as ducts, bodies of water, etc. ServiceRequest supports all these usages. The service request may represent an order that is entered by a practitioner in a CPOE system as well as a proposal made by a clinical decision support (CDS) system based on a patient's clinical record and context of care. Planned procedures referenced by a CarePlan may also be represented by this resource. The general work flow that this resource facilitates is that a clinical system creates a service request. The service request is then accessed by or exchanged with a system, perhaps via intermediaries, that represents an organization (e.g., diagnostic or imaging service, surgical team, physical therapy department) that can perform the procedure. The organization receiving the service request will, after it accepts the request, update the request as the work is performed, and then finally issue a report that references the requests that it fulfilled. The ServiceRequest resource allows requesting only a single procedure. If a workflow requires requesting multiple procedures simultaneously, this is done using multiple instances of this resource. These instances can be linked in different ways, depending on the needs of the workflow. For guidance, refer to the Request pattern. ServiceRequest is a record of a proposal/plan or order for a service to be performed that would result in a Procedure, Observation, DiagnosticReport, ImagingStudy or similar resource. In contrast to ServiceRequest, Task which spans both intent and event and tracks the execution through to completion and is intended for 'administrative' actions like requesting and tracking things to be done to a record, or keeping track of a checklist of steps such to be performed as part of a fulfilment process. A ServiceRequest can be higher-level authorization that triggered the creation of Task, or it can be the 'request' resource Task is seeking to fulfill. ServiceRequest and CommunicationRequest are related. A CommunicationRequest is a request to merely disclose information. Whereas a ServiceRequest would be used to request information as part of training or counseling - i.e. when the process will involve verification of the patient's comprehension or an attempt to change the patient's mental state. In some workflows both may exist. For example, upon receiving a CommunicationRequest a practitioner might initiate a ServiceRequest.", "structure": { "resourceType": "ServiceRequest", "identifier": [ { "Identifier": {} } ], "instantiatesCanonical": [ "<canonical(ActivityDefinition|PlanDefinition)>" ], "instantiatesUri": [ "<uri>" ], "basedOn": [ { "Reference(CarePlan|MedicationRequest|ServiceRequest)": {} } ], "replaces": [ { "Reference(ServiceRequest)": {} } ], "requisition": { "Identifier": {} }, "status": "<code>", "intent": "<code>", "category": [ { "CodeableConcept": {} } ], "priority": "<code>", "doNotPerform": "<boolean>", "code": { "CodeableReference(ActivityDefinition|PlanDefinition)": {} }, "orderDetail": [ { "parameterFocus": { "CodeableReference(BiologicallyDerivedProduct|Device|DeviceDefinition|DeviceRequest|Medication|MedicationRequest|Substance|SupplyRequest)": {} }, "parameter": [ { "code": { "CodeableConcept": {} }, "valueQuantity": { "Quantity": {} }, "valueRatio": { "Ratio": {} }, "valueRange": { "Range": {} }, "valueBoolean": "<boolean>", "valueCodeableConcept": { "CodeableConcept": {} }, "valueString": "<string>", "valuePeriod": { "Period": {} } } ] } ], "quantityQuantity": { "Quantity": {} }, "quantityRatio": { "Ratio": {} }, "quantityRange": { "Range": {} }, "subject": { "Reference(Device|Group|Location|Patient)": {} }, "focus": [ { "Reference(Any)": {} } ], "encounter": { "Reference(Encounter)": {} }, "occurrenceDateTime": "<dateTime>", "occurrencePeriod": { "Period": {} }, "occurrenceTiming": { "Timing": {} }, "asNeededBoolean": "<boolean>", "asNeededCodeableConcept": { "CodeableConcept": {} }, "authoredOn": "<dateTime>", "requester": { "Reference(Device|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson)": {} }, "performerType": { "CodeableConcept": {} }, "performer": [ { "Reference(CareTeam|Device|HealthcareService|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson)": {} } ], "location": [ { "CodeableReference(Location)": {} } ], "reason": [ { "CodeableReference(Condition|DetectedIssue|DiagnosticReport|DocumentReference|Observation)": {} } ], "insurance": [ { "Reference(ClaimResponse|Coverage)": {} } ], "supportingInfo": [ { "CodeableReference(Any)": {} } ], "specimen": [ { "Reference(Specimen)": {} } ], "bodySite": [ { "CodeableConcept": {} } ], "bodyStructure": { "Reference(BodyStructure)": {} }, "note": [ { "Annotation": {} } ], "patientInstruction": [ { "instructionMarkdown": "<markdown>", "instructionReference": { "Reference(DocumentReference)": {} } } ], "relevantHistory": [ { "Reference(Provenance)": {} } ] } } 
{"resource": "NutritionOrder", "description": "The NutritionOrder resource describes a request for oral diets (including general diets such as General Healthy diet, or therapeutic diets such as Consistent Carbohydrate, 2 gram Sodium, or Fluid Restricted), oral nutrition supplements (such as nutritionally complete pre-packed drinks), enteral nutrition (tube feedings) and infant formula which govern the distribution of food and nutritional products used to feed patients within an in-patient setting. It does not cover orders for parenteral (IV) nutrition which are typically filled by pharmacy. These nutrition orders are combined with information on a patient's food allergies and intolerances, and ethnic or cultural food preferences (e.g. Kosher or Vegetarian) to inform healthcare personnel about the type, texture, and/or quantity of foods that the patient should receive or consume. Enteral orders are distinguished from supplements because they have some unique attributes and typically include administration information whereas oral nutritional supplements may simply be supplied (e.g. home health or outpatient settings). In a simple case, the requestor may designate type of product, product name and the route of administration along with free text instructions without a having to complete the additional structured details. This resource is intended to be used by providers from a variety of specialties such as physicians, dietitian/nutritionists, or speech therapists. One provider may simply order a base element oral diet such as General Healthful diet. Another provider, based on scope of practice, may use other elements to communicate additional therapeutic needs or patient preferences. The optionality included gives an ordering provider the capability to write a simple order for an oral diet, nutritional supplement or formula with minimal requirements beyond that of specifying the diet, supplement or formula product, but also supports the ability to provide more detailed information that may be further augmented by a dietitian or nutrition specialist. For example, a physician may order a 2 g sodium diet. A speech therapist, based on the results of a swallowing evaluation, then orders a mechanically altered texture with nectar thick liquids. The NutritionOrder resource is used for requesting oral diets, oral nutrition supplements and enteral feedings in an in-patient setting. The MedicationRequest resource should be used for requesting parenteral (IV) nutrition and prescribing dietary supplements such as vitamin or mineral supplements. The Nutrition Order is a record of the request for the supply of a diet, oral supplement or enteral formulas for a patient. However, to initiate the request requires the use of the Task resource and its associated workflow with the Nutrition Order referenced from Task.basedOn, or by using the Nutrition Task resource in the context of a messaging or service workflow where the request is explicit or implicit.", "structure": { "resourceType": "NutritionOrder", "identifier": [ { "Identifier": {} } ], "instantiatesCanonical": [ "<canonical(ActivityDefinition|PlanDefinition)>" ], "instantiatesUri": [ "<uri>" ], "instantiates": [ "<uri>" ], "basedOn": [ { "Reference(CarePlan|NutritionOrder|ServiceRequest)": {} } ], "groupIdentifier": { "Identifier": {} }, "status": "<code>", "intent": "<code>", "priority": "<code>", "subject": { "Reference(Group|Patient)": {} }, "encounter": { "Reference(Encounter)": {} }, "supportingInformation": [ { "Reference(Any)": {} } ], "dateTime": "<dateTime>", "orderer": { "Reference(Practitioner|PractitionerRole)": {} }, "performer": [ { "CodeableReference(CareTeam|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson)": {} } ], "allergyIntolerance": [ { "Reference(AllergyIntolerance)": {} } ], "foodPreferenceModifier": [ { "CodeableConcept": {} } ], "excludeFoodModifier": [ { "CodeableConcept": {} } ], "outsideFoodAllowed": "<boolean>", "oralDiet": { "type": [ { "CodeableConcept": {} } ], "schedule": { "timing": [ { "Timing": {} } ], "asNeeded": "<boolean>", "asNeededFor": { "CodeableConcept": {} } }, "nutrient": [ { "modifier": { "CodeableConcept": {} }, "amount": { "Quantity(SimpleQuantity)": {} } } ], "texture": [ { "modifier": { "CodeableConcept": {} }, "foodType": { "CodeableConcept": {} } } ], "fluidConsistencyType": [ { "CodeableConcept": {} } ], "instruction": "<string>" }, "supplement": [ { "type": { "CodeableReference(NutritionProduct)": {} }, "productName": "<string>", "schedule": { "timing": [ { "Timing": {} } ], "asNeeded": "<boolean>", "asNeededFor": { "CodeableConcept": {} } }, "quantity": { "Quantity(SimpleQuantity)": {} }, "instruction": "<string>" } ], "enteralFormula": { "baseFormulaType": { "CodeableReference(NutritionProduct)": {} }, "baseFormulaProductName": "<string>", "deliveryDevice": [ { "CodeableReference(DeviceDefinition)": {} } ], "additive": [ { "type": { "CodeableReference(NutritionProduct)": {} }, "productName": "<string>", "quantity": { "Quantity(SimpleQuantity)": {} } } ], "caloricDensity": { "Quantity(SimpleQuantity)": {} }, "routeOfAdministration": { "CodeableConcept": {} }, "administration": [ { "schedule": { "timing": [ { "Timing": {} } ], "asNeeded": "<boolean>", "asNeededFor": { "CodeableConcept": {} } }, "quantity": { "Quantity(SimpleQuantity)": {} }, "rateQuantity": { "Quantity(SimpleQuantity)": {} }, "rateRatio": { "Ratio": {} } } ], "maxVolumeToDeliver": { "Quantity(SimpleQuantity)": {} }, "administrationInstruction": "<markdown>" }, "note": [ { "Annotation": {} } ] } } 
{"resource": "NutritionIntake", "description": "The NutritionIntake resource, in conjunction with the NutritionProduct resource, is utilized to capture details about the consumption of foods, fluids, and enteral nutrition. Dietitians and other clinicians use the data to calculate how much nutrition a patient has taken in. NutritionIntake represents the event of consuming food, fluid, etc. and NutritionProduct represents the actual food items. NutritionIntake can also be used to record a person’s intake through uses of food tracking apps (e.g.MyFitnessPal), any grocery store purchases, or a student’s meal consumption in a school district. NutritionIntake can be utilized in many environments where food is served, consumed or purchased: hospitals/acute care, meal tracking systems, school districts, grocery stores, outpatient settings, LTC, etc. NutritionIntake should be general enough to capture intake regardless of country or region. Parenteral nutrition is out of scope as this ordering is handled through MedicationRequest, thus administration of parenteral nutrition should also be captured through Oral intake of food, fluids, oral nutritional supplements (i.e. Ensure), or enteral nutrition should be recorded using the NutritionIntake resource. Supplements, such as vitamins, minerals, herbals, should be recorded using the medication resources Parenteral nutrition should be recorded using the medication resources As a dietitian, it is important to be able to know what a person is consuming and assess the adequacy of the patient’s diet. Capturing a patient’s intake is important to establish a baseline, determine care, track trends, and see improvement of that patient. Dietitians might use intake data to see patterns, such as when a diabetic patient’s blood glucose is consistently high due to over consumption of carbohydrates. Other clinicians have the need to monitor intake as well; for example, a nurse might need to know intake for administering insulin prior to meals or a physician may need to ensure a patient on a fluid restriction is following orders. Having intake documented within its own resource allows for consistency in documentation acrossmultiple disciplines and settings. In some instances, the Observation resource has been extended to capture intake; while this allows for a quick way to document intake, the Observation resource does not provide all the detail necessary, such as capturing all the nutrients ( including calories, vitamins, minerals, carbohydrates, etc.). Previous implementation attempts of using the Observation resourcehave noted this is cumbersome and has required too many extensions without being able to documentall the necessary details tied to ingredients in food and fluid products.", "structure": { "resourceType": "NutritionIntake", "identifier": [ { "Identifier": {} } ], "instantiatesCanonical": [ "<canonical(Definition)>" ], "instantiatesUri": [ "<uri>" ], "basedOn": [ { "Reference(CarePlan|NutritionOrder|ServiceRequest)": {} } ], "partOf": [ { "Reference(NutritionIntake|Observation|Procedure)": {} } ], "status": "<code>", "statusReason": [ { "CodeableConcept": {} } ], "code": { "CodeableConcept": {} }, "subject": { "Reference(Group|Patient)": {} }, "encounter": { "Reference(Encounter)": {} }, "occurrenceDateTime": "<dateTime>", "occurrencePeriod": { "Period": {} }, "recorded": "<dateTime>", "reportedBoolean": "<boolean>", "reportedReference": { "Reference(Organization|Patient|Practitioner|PractitionerRole|RelatedPerson)": {} }, "consumedItem": [ { "type": { "CodeableConcept": {} }, "nutritionProduct": { "CodeableReference(NutritionProduct)": {} }, "schedule": { "Timing": {} }, "amount": { "Quantity(SimpleQuantity)": {} }, "rate": { "Quantity(SimpleQuantity)": {} }, "notConsumed": "<boolean>", "notConsumedReason": { "CodeableConcept": {} } } ], "ingredientLabel": [ { "nutrient": { "CodeableReference(Substance)": {} }, "amount": { "Quantity(SimpleQuantity)": {} } } ], "performer": [ { "function": { "CodeableConcept": {} }, "actor": { "Reference(CareTeam|Device|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson)": {} } } ], "location": { "Reference(Location)": {} }, "derivedFrom": [ { "Reference(Any)": {} } ], "reason": [ { "CodeableReference(Condition|DiagnosticReport|DocumentReference|Observation)": {} } ], "note": [ { "Annotation": {} } ] } } 
{"resource": "VisionPrescription", "description": "The VisionPrescription resource is intended to support the information requirements for a prescription for glasses and contact lenses for a patient. Corrective optical lenses are considered a controlled substance and therefore a prescription is typically required for the provision of patient-specific lenses. Vision prescriptions may only be issued by providers who have optical diagnosis within their scope of practice, typically ophthalmologists and optometrists. The prescription is a time-limited, typically two years, authorization for the provision of an unlimited number of lenses, glasses or contacts, which conform to the authorized specification by providers which have lens provision within their scope of practice, typically ophthalmologists, optometrists and opticians. Health insurers typically require a copy of the prescription to ensure that a vision professional has examined the patient and that the power of the lenses exceeds some minimum, such as +- 0.75 diopters, to qualify for reimbursement under the insurance coverage.", "structure": { "resourceType": "VisionPrescription", "identifier": [ { "Identifier": {} } ], "status": "<code>", "created": "<dateTime>", "patient": { "Reference(Patient)": {} }, "encounter": { "Reference(Encounter)": {} }, "dateWritten": "<dateTime>", "prescriber": { "Reference(Practitioner|PractitionerRole)": {} }, "lensSpecification": [ { "product": { "CodeableConcept": {} }, "eye": "<code>", "sphere": "<decimal>", "cylinder": "<decimal>", "axis": "<integer>", "prism": [ { "amount": "<decimal>", "base": "<code>" } ], "add": "<decimal>", "power": "<decimal>", "backCurve": "<decimal>", "diameter": "<decimal>", "duration": { "Quantity(SimpleQuantity)": {} }, "color": "<string>", "brand": "<string>", "note": [ { "Annotation": {} } ] } ] } } 
{"resource": "RiskAssessment", "description": "This resource captures predicted outcomes for a patient or population on the basis of source information. Examples include: A prognosis statement for a particular condition Risk of health outcome (heart attack, particular type of cancer) on the basis of lifestyle factors and/or family history List of potential health risks based on a patient's genetic analysis A prediction of outbreak infection rates within a geography based on immunization rates This resource can be used to represent the results of formal scoring/decision support tools that evaluate risk. It can also be used to capture a practitioner's subjective assessment of the patient's risk based on existing knowledge and previous experience. Risk assessments are a specialized type of observation. A specialized resource is used to provide a simpler mechanism to capture of a series of risks and to associate those risks with time-ranges, probabilities, etc. All risk assertions are captured at one time based on a single set of source inputs. Capture of a single risk MAY be done using the Observation class, particularly in circumstances where it's treated as a generic observation, but for consistency, all risk assessments and prognosis SHOULD be captured using RiskAssessment. Risk assessments may be based on a variety of factors, including: Basic demographic information from the Patient or Group resources Various Observations including vital signs, lab information, assessments, genetic information, etc. FamilyMemberHistory Current, past and proposed therapies Immunization, Procedure, CarePlan, etc. Because so many resources can potentially be used, no limit is placed on what resources can be sent in RiskAssessment.basis. However, some resources would be nonsensical for this use (e.g. MessageHeader). AllergyIntolerance and RiskAssessment AllergyIntolerance describes a specific type of risk - propensity to reaction to a substance while RiskAssessment describes general risks to a subject, not generally based on a reaction. Risk Assessments can be determined manually by health-care providers based on their professional expertise, by using an algorithmic scoring system or through a combination. Risk assessments can also be computed by decision support systems. OperationDefinitions may be defined by servers to generate risk assessments based on particular combinations of source resources or other inputs.", "structure": { "resourceType": "RiskAssessment", "identifier": [ { "Identifier": {} } ], "basedOn": { "Reference(Any)": {} }, "parent": { "Reference(Any)": {} }, "status": "<code>", "method": { "CodeableConcept": {} }, "code": { "CodeableConcept": {} }, "subject": { "Reference(Group|Patient)": {} }, "encounter": { "Reference(Encounter)": {} }, "occurrenceDateTime": "<dateTime>", "occurrencePeriod": { "Period": {} }, "condition": { "Reference(Condition)": {} }, "performer": { "Reference(Device|Patient|Practitioner|PractitionerRole|RelatedPerson)": {} }, "reason": [ { "CodeableReference(Condition|DiagnosticReport|DocumentReference|Observation)": {} } ], "basis": [ { "Reference(Any)": {} } ], "prediction": [ { "outcome": { "CodeableConcept": {} }, "probabilityDecimal": "<decimal>", "probabilityRange": { "Range": {} }, "qualitativeRisk": { "CodeableConcept": {} }, "relativeRisk": "<decimal>", "whenPeriod": { "Period": {} }, "whenRange": { "Range": {} }, "rationale": "<string>" } ], "mitigation": "<string>", "note": [ { "Annotation": {} } ] } } 
{"resource": "RequestOrchestration", "description": "The RequestOrchestration resource is used to represent a set of optional and related activities that may be performed for a specific patient or context. This resource is often, but not always, the result of applying a specific PlanDefinition to a particular patient. Other than differences that tie the RequestOrchestration to a particular subject and setting, the actionDefinition element of PlanDefinition is identical to the action element of the RequestOrchestration, allowing the same features and functionality to be used in both places to describe optionality of and relationships between activities in a workflow. RequestOrchestrations can contain hierarchical groups of actions, where each specific action references the action to be performed (in terms of a Request resource), and each group describes additional behavior, relationships, and applicable conditions between the actions in the overall group.", "structure": { "resourceType": "RequestOrchestration", "identifier": [ { "Identifier": {} } ], "instantiatesCanonical": [ "<canonical>" ], "instantiatesUri": [ "<uri>" ], "basedOn": [ { "Reference(Any)": {} } ], "replaces": [ { "Reference(Any)": {} } ], "groupIdentifier": { "Identifier": {} }, "status": "<code>", "intent": "<code>", "priority": "<code>", "code": { "CodeableConcept": {} }, "subject": { "Reference(CareTeam|Device|Group|HealthcareService|Location|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson)": {} }, "encounter": { "Reference(Encounter)": {} }, "authoredOn": "<dateTime>", "author": { "Reference(Device|Practitioner|PractitionerRole)": {} }, "reason": [ { "CodeableReference(Condition|DiagnosticReport|DocumentReference|Observation)": {} } ], "goal": [ { "Reference(Goal)": {} } ], "note": [ { "Annotation": {} } ], "action": [ { "linkId": "<string>", "prefix": "<string>", "title": "<string>", "description": "<markdown>", "textEquivalent": "<markdown>", "priority": "<code>", "code": [ { "CodeableConcept": {} } ], "documentation": [ { "RelatedArtifact": {} } ], "goal": [ { "Reference(Goal)": {} } ], "condition": [ { "kind": "<code>", "expression": { "Expression": {} } } ], "input": [ { "title": "<string>", "requirement": { "DataRequirement": {} }, "relatedData": "<id>" } ], "output": [ { "title": "<string>", "requirement": { "DataRequirement": {} }, "relatedData": "<string>" } ], "relatedAction": [ { "targetId": "<id>", "relationship": "<code>", "endRelationship": "<code>", "offsetDuration": { "Duration": {} }, "offsetRange": { "Range": {} } } ], "timingDateTime": "<dateTime>", "timingAge": { "Age": {} }, "timingPeriod": { "Period": {} }, "timingDuration": { "Duration": {} }, "timingRange": { "Range": {} }, "timingTiming": { "Timing": {} }, "location": { "CodeableReference(Location)": {} }, "participant": [ { "type": "<code>", "typeCanonical": "<canonical(CapabilityStatement)>", "typeReference": { "Reference(CareTeam|Device|DeviceDefinition|Endpoint|Group|HealthcareService|Location|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson)": {} }, "role": { "CodeableConcept": {} }, "function": { "CodeableConcept": {} }, "actorCanonical": "<canonical(CapabilityStatement)>", "actorReference": { "Reference(CareTeam|Device|DeviceDefinition|Endpoint|Group|HealthcareService|Location|Organization|Patient|Practitioner|PractitionerRole|RelatedPerson)": {} } } ], "type": { "CodeableConcept": {} }, "groupingBehavior": "<code>", "selectionBehavior": "<code>", "requiredBehavior": "<code>", "precheckBehavior": "<code>", "cardinalityBehavior": "<code>", "resource": { "Reference(Any)": {} }, "definitionCanonical": "<canonical(ActivityDefinition|ObservationDefinition|PlanDefinition|Questionnaire|SpecimenDefinition)>", "definitionUri": "<uri>", "transform": "<canonical(StructureMap)>", "dynamicValue": [ { "path": "<string>", "expression": { "Expression": {} } } ], "action": [ { "Content as for RequestOrchestration.action": {} } ] } ] } } 
